{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "02c30e4b-4cca-4698-9401-627c1750acde",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting langchain==0.0.320\n",
      "  Downloading langchain-0.0.320-py3-none-any.whl.metadata (15 kB)\n",
      "Collecting langchain_experimental==0.0.32\n",
      "  Downloading langchain_experimental-0.0.32-py3-none-any.whl.metadata (1.8 kB)\n",
      "Collecting openai==0.28.1\n",
      "  Downloading openai-0.28.1-py3-none-any.whl.metadata (11 kB)\n",
      "Collecting rdflib\n",
      "  Downloading rdflib-7.0.0-py3-none-any.whl.metadata (11 kB)\n",
      "Collecting neo4j==5.0.1\n",
      "  Downloading neo4j-5.0.1.tar.gz (172 kB)\n",
      "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m172.4/172.4 kB\u001b[0m \u001b[31m2.7 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n",
      "\u001b[?25h  Preparing metadata (setup.py) ... \u001b[?25ldone\n",
      "\u001b[?25hCollecting psycopg2-binary\n",
      "  Downloading psycopg2_binary-2.9.9-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (4.4 kB)\n",
      "Requirement already satisfied: PyYAML>=5.3 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (6.0.1)\n",
      "Requirement already satisfied: SQLAlchemy<3,>=1.4 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (2.0.22)\n",
      "Requirement already satisfied: aiohttp<4.0.0,>=3.8.3 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (3.8.6)\n",
      "Collecting anyio<4.0 (from langchain==0.0.320)\n",
      "  Downloading anyio-3.7.1-py3-none-any.whl.metadata (4.7 kB)\n",
      "Collecting dataclasses-json<0.7,>=0.5.7 (from langchain==0.0.320)\n",
      "  Downloading dataclasses_json-0.6.2-py3-none-any.whl.metadata (25 kB)\n",
      "Requirement already satisfied: jsonpatch<2.0,>=1.33 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (1.33)\n",
      "Collecting langsmith<0.1.0,>=0.0.43 (from langchain==0.0.320)\n",
      "  Downloading langsmith-0.0.63-py3-none-any.whl.metadata (10 kB)\n",
      "Requirement already satisfied: numpy<2,>=1 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (1.24.4)\n",
      "Collecting pydantic<3,>=1 (from langchain==0.0.320)\n",
      "  Downloading pydantic-2.4.2-py3-none-any.whl.metadata (158 kB)\n",
      "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m158.6/158.6 kB\u001b[0m \u001b[31m2.2 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n",
      "\u001b[?25hRequirement already satisfied: requests<3,>=2 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (2.31.0)\n",
      "Collecting tenacity<9.0.0,>=8.1.0 (from langchain==0.0.320)\n",
      "  Downloading tenacity-8.2.3-py3-none-any.whl.metadata (1.0 kB)\n",
      "Requirement already satisfied: tqdm in /opt/conda/lib/python3.11/site-packages (from openai==0.28.1) (4.66.1)\n",
      "Requirement already satisfied: pytz in /opt/conda/lib/python3.11/site-packages (from neo4j==5.0.1) (2023.3.post1)\n",
      "Collecting isodate<0.7.0,>=0.6.0 (from rdflib)\n",
      "  Downloading isodate-0.6.1-py2.py3-none-any.whl (41 kB)\n",
      "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m41.7/41.7 kB\u001b[0m \u001b[31m2.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
      "\u001b[?25hRequirement already satisfied: pyparsing<4,>=2.1.0 in /opt/conda/lib/python3.11/site-packages (from rdflib) (3.1.1)\n",
      "Requirement already satisfied: attrs>=17.3.0 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (23.1.0)\n",
      "Requirement already satisfied: charset-normalizer<4.0,>=2.0 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (3.3.0)\n",
      "Requirement already satisfied: multidict<7.0,>=4.5 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (6.0.4)\n",
      "Requirement already satisfied: async-timeout<5.0,>=4.0.0a3 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (4.0.3)\n",
      "Requirement already satisfied: yarl<2.0,>=1.0 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (1.9.2)\n",
      "Requirement already satisfied: frozenlist>=1.1.1 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (1.4.0)\n",
      "Requirement already satisfied: aiosignal>=1.1.2 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (1.3.1)\n",
      "Requirement already satisfied: idna>=2.8 in /opt/conda/lib/python3.11/site-packages (from anyio<4.0->langchain==0.0.320) (3.4)\n",
      "Requirement already satisfied: sniffio>=1.1 in /opt/conda/lib/python3.11/site-packages (from anyio<4.0->langchain==0.0.320) (1.3.0)\n",
      "Collecting marshmallow<4.0.0,>=3.18.0 (from dataclasses-json<0.7,>=0.5.7->langchain==0.0.320)\n",
      "  Downloading marshmallow-3.20.1-py3-none-any.whl.metadata (7.8 kB)\n",
      "Collecting typing-inspect<1,>=0.4.0 (from dataclasses-json<0.7,>=0.5.7->langchain==0.0.320)\n",
      "  Downloading typing_inspect-0.9.0-py3-none-any.whl.metadata (1.5 kB)\n",
      "Requirement already satisfied: six in /opt/conda/lib/python3.11/site-packages (from isodate<0.7.0,>=0.6.0->rdflib) (1.16.0)\n",
      "Requirement already satisfied: jsonpointer>=1.9 in /opt/conda/lib/python3.11/site-packages (from jsonpatch<2.0,>=1.33->langchain==0.0.320) (2.4)\n",
      "Collecting annotated-types>=0.4.0 (from pydantic<3,>=1->langchain==0.0.320)\n",
      "  Downloading annotated_types-0.6.0-py3-none-any.whl.metadata (12 kB)\n",
      "Collecting pydantic-core==2.10.1 (from pydantic<3,>=1->langchain==0.0.320)\n",
      "  Downloading pydantic_core-2.10.1-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (6.5 kB)\n",
      "Requirement already satisfied: typing-extensions>=4.6.1 in /opt/conda/lib/python3.11/site-packages (from pydantic<3,>=1->langchain==0.0.320) (4.8.0)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/conda/lib/python3.11/site-packages (from requests<3,>=2->langchain==0.0.320) (2.0.7)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in /opt/conda/lib/python3.11/site-packages (from requests<3,>=2->langchain==0.0.320) (2023.7.22)\n",
      "Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.11/site-packages (from SQLAlchemy<3,>=1.4->langchain==0.0.320) (3.0.0)\n",
      "Requirement already satisfied: packaging>=17.0 in /opt/conda/lib/python3.11/site-packages (from marshmallow<4.0.0,>=3.18.0->dataclasses-json<0.7,>=0.5.7->langchain==0.0.320) (23.2)\n",
      "Collecting mypy-extensions>=0.3.0 (from typing-inspect<1,>=0.4.0->dataclasses-json<0.7,>=0.5.7->langchain==0.0.320)\n",
      "  Downloading mypy_extensions-1.0.0-py3-none-any.whl (4.7 kB)\n",
      "Downloading langchain-0.0.320-py3-none-any.whl (1.9 MB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m1.9/1.9 MB\u001b[0m \u001b[31m7.2 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m00:01\u001b[0m00:01\u001b[0m\n",
      "\u001b[?25hDownloading langchain_experimental-0.0.32-py3-none-any.whl (151 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m151.6/151.6 kB\u001b[0m \u001b[31m5.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
      "\u001b[?25hDownloading openai-0.28.1-py3-none-any.whl (76 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m77.0/77.0 kB\u001b[0m \u001b[31m3.3 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
      "\u001b[?25hDownloading rdflib-7.0.0-py3-none-any.whl (531 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m531.9/531.9 kB\u001b[0m \u001b[31m6.5 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m00:01\u001b[0m00:01\u001b[0m\n",
      "\u001b[?25hDownloading psycopg2_binary-2.9.9-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (3.0 MB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m3.0/3.0 MB\u001b[0m \u001b[31m7.2 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m00:01\u001b[0m00:01\u001b[0m\n",
      "\u001b[?25hDownloading anyio-3.7.1-py3-none-any.whl (80 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m80.9/80.9 kB\u001b[0m \u001b[31m3.1 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
      "\u001b[?25hDownloading dataclasses_json-0.6.2-py3-none-any.whl (28 kB)\n",
      "Downloading langsmith-0.0.63-py3-none-any.whl (45 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m45.3/45.3 kB\u001b[0m \u001b[31m2.2 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
      "\u001b[?25hDownloading pydantic-2.4.2-py3-none-any.whl (395 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m395.8/395.8 kB\u001b[0m \u001b[31m6.7 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n",
      "\u001b[?25hDownloading pydantic_core-2.10.1-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (2.0 MB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m2.0/2.0 MB\u001b[0m \u001b[31m7.5 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n",
      "\u001b[?25hDownloading tenacity-8.2.3-py3-none-any.whl (24 kB)\n",
      "Downloading annotated_types-0.6.0-py3-none-any.whl (12 kB)\n",
      "Downloading marshmallow-3.20.1-py3-none-any.whl (49 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m49.4/49.4 kB\u001b[0m \u001b[31m2.5 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
      "\u001b[?25hDownloading typing_inspect-0.9.0-py3-none-any.whl (8.8 kB)\n",
      "Building wheels for collected packages: neo4j\n",
      "  Building wheel for neo4j (setup.py) ... \u001b[?25ldone\n",
      "\u001b[?25h  Created wheel for neo4j: filename=neo4j-5.0.1-py3-none-any.whl size=247361 sha256=7590e8a2c9c74e7e247113b5072973f64fe23ce97289e4b77ada8cd59fb3b1e1\n",
      "  Stored in directory: /home/jovyan/.cache/pip/wheels/c2/33/c6/fa22720f17810f856b71d7a5bfb579f56f6eb1fc00ba00262a\n",
      "Successfully built neo4j\n",
      "Installing collected packages: tenacity, pydantic-core, psycopg2-binary, neo4j, mypy-extensions, marshmallow, isodate, anyio, annotated-types, typing-inspect, rdflib, pydantic, openai, langsmith, dataclasses-json, langchain, langchain_experimental\n",
      "  Attempting uninstall: anyio\n",
      "    Found existing installation: anyio 4.0.0\n",
      "    Uninstalling anyio-4.0.0:\n",
      "      Successfully uninstalled anyio-4.0.0\n",
      "Successfully installed annotated-types-0.6.0 anyio-3.7.1 dataclasses-json-0.6.2 isodate-0.6.1 langchain-0.0.320 langchain_experimental-0.0.32 langsmith-0.0.63 marshmallow-3.20.1 mypy-extensions-1.0.0 neo4j-5.0.1 openai-0.28.1 psycopg2-binary-2.9.9 pydantic-2.4.2 pydantic-core-2.10.1 rdflib-7.0.0 tenacity-8.2.3 typing-inspect-0.9.0\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "!{sys.executable} -m pip install langchain==0.0.320 langchain_experimental==0.0.32 openai==0.28.1 rdflib neo4j==5.0.1 psycopg2-binary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "67c8816d-1782-49b9-addc-7d4110cb8e2e",
   "metadata": {},
   "outputs": [],
   "source": [
    "from os import getcwd\n",
    "from os.path import join, dirname\n",
    "folder = dirname(getcwd())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "54f31dd1-f869-476b-96d0-a40690a57d28",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import json\n",
    "from langchain.chat_models import ChatOpenAI\n",
    "from langchain.chains import GraphSparqlQAChain\n",
    "from langchain.graphs import RdfGraph\n",
    "\n",
    "credentials = join(folder, \"credentials.json\")\n",
    "with open(credentials) as f:\n",
    "    data = json.load(f)\n",
    "    key = data['OPENAI_API_KEY']\n",
    "    \n",
    "os.environ['OPENAI_API_KEY'] = key"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "b8f0b1a1-a6aa-4a19-9cdf-8e83d46547f1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "CREATE TABLE assignment (\n",
      "\temployee_id VARCHAR(80) NOT NULL, \n",
      "\tcompetence_id VARCHAR(80) NOT NULL, \n",
      "\tlevel VARCHAR(50), \n",
      "\tinterest VARCHAR(50), \n",
      "\tCONSTRAINT assignment_pkey PRIMARY KEY (employee_id, competence_id), \n",
      "\tCONSTRAINT assignment_competence_id_fkey FOREIGN KEY(competence_id) REFERENCES competences (id), \n",
      "\tCONSTRAINT assignment_employee_id_fkey FOREIGN KEY(employee_id) REFERENCES employees (id)\n",
      ")\n",
      "\n",
      "/*\n",
      "3 rows from assignment table:\n",
      "employee_id\tcompetence_id\tlevel\tinterest\n",
      "EMPLOYEE_1\t2.5\t2\t0\n",
      "EMPLOYEE_1\t2.1\t5\t0\n",
      "EMPLOYEE_1\t5.4\t4\t0\n",
      "*/\n",
      "\n",
      "\n",
      "CREATE TABLE competences (\n",
      "\tid VARCHAR(80) NOT NULL, \n",
      "\tdimension INTEGER, \n",
      "\tcompetence TEXT, \n",
      "\tdescription TEXT, \n",
      "\tCONSTRAINT competences_pkey PRIMARY KEY (id)\n",
      ")\n",
      "\n",
      "/*\n",
      "3 rows from competences table:\n",
      "id\tdimension\tcompetence\tdescription\n",
      "1\t1\tInformation and data literacy\tTo articulate information needs, to locate and retrieve digital data, information and content. To ju\n",
      "1.1\t2\tBrowsing, searching and filtering data, information and digital content\tTo articulate information needs , to search for data, information and content in digital environment\n",
      "1.2\t2\tEvaluating data, information and digital content\tTo analyse, compare and critically evaluate the credibility and reliability of sources of data, info\n",
      "*/\n",
      "\n",
      "\n",
      "CREATE TABLE employees (\n",
      "\tid VARCHAR(80) NOT NULL, \n",
      "\tname VARCHAR(50), \n",
      "\tsurname VARCHAR(50), \n",
      "\tunit VARCHAR(50), \n",
      "\tCONSTRAINT employees_pkey PRIMARY KEY (id)\n",
      ")\n",
      "\n",
      "/*\n",
      "3 rows from employees table:\n",
      "id\tname\tsurname\tunit\n",
      "EMPLOYEE_1\tJane\tSmith\tHuman Resources\n",
      "EMPLOYEE_2\tDavid\tBrown\tEngineering\n",
      "EMPLOYEE_3\tOlivia\tDavis\tEngineering\n",
      "*/\n"
     ]
    }
   ],
   "source": [
    "#SQL\n",
    "from langchain.llms import OpenAI\n",
    "from langchain.utilities import SQLDatabase\n",
    "from langchain_experimental.sql import SQLDatabaseChain\n",
    "\n",
    "# Setup database\n",
    "database = \"competence-kg-postgres\"\n",
    "db = SQLDatabase.from_uri(\n",
    "    f\"postgresql+psycopg2://postgres:kgCefriel@competence-kg-postgres:5432/{database}\",\n",
    ")\n",
    "\n",
    "print(db.get_table_info())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "86fa5e2a-61fd-417f-b6fa-3c596664ecf7",
   "metadata": {},
   "outputs": [],
   "source": [
    "chain_sql = SQLDatabaseChain.from_llm(ChatOpenAI(temperature=0), db=db, verbose=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "22b34388-95b0-4edb-97bd-32c89cf9f3b4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new SQLDatabaseChain chain...\u001b[0m\n",
      "Retrieve the complete list of competences of Jane Brown\n",
      "SQLQuery:\u001b[32;1m\u001b[1;3mSELECT c.competence\n",
      "FROM competences c\n",
      "JOIN assignment a ON c.id = a.competence_id\n",
      "JOIN employees e ON a.employee_id = e.id\n",
      "WHERE e.name = 'Jane' AND e.surname = 'Brown'\u001b[0m\n",
      "SQLResult: \u001b[33;1m\u001b[1;3m[('Protecting the environment',), ('Protecting health and well-being',), ('Protecting personal data and privacy',), ('Programming',), ('Managing data, information and digital content',), ('Copyright and licences',), ('Creatively using digital technologies',), ('Solving technical problems',), ('Interacting through digital technologies',), ('Netiquette',)]\u001b[0m\n",
      "Answer:\u001b[32;1m\u001b[1;3mProtecting the environment, Protecting health and well-being, Protecting personal data and privacy, Programming, Managing data, information and digital content, Copyright and licences, Creatively using digital technologies, Solving technical problems, Interacting through digital technologies, Netiquette\u001b[0m\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Protecting the environment, Protecting health and well-being, Protecting personal data and privacy, Programming, Managing data, information and digital content, Copyright and licences, Creatively using digital technologies, Solving technical problems, Interacting through digital technologies, Netiquette'"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sql.run(\"Retrieve the complete list of competences of Jane Brown\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "b39e43af-c98b-423c-9530-f3e72e57630a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new SQLDatabaseChain chain...\u001b[0m\n",
      "What are the competences of Jane Brown?\n",
      "SQLQuery:\u001b[32;1m\u001b[1;3mSELECT c.competence\n",
      "FROM competences c\n",
      "JOIN assignment a ON c.id = a.competence_id\n",
      "JOIN employees e ON a.employee_id = e.id\n",
      "WHERE e.name = 'Jane' AND e.surname = 'Brown'\n",
      "LIMIT 5;\u001b[0m\n",
      "SQLResult: \u001b[33;1m\u001b[1;3m[('Protecting the environment',), ('Protecting health and well-being',), ('Protecting personal data and privacy',), ('Programming',), ('Managing data, information and digital content',)]\u001b[0m\n",
      "Answer:\u001b[32;1m\u001b[1;3mThe competences of Jane Brown are:\n",
      "1. Protecting the environment\n",
      "2. Protecting health and well-being\n",
      "3. Protecting personal data and privacy\n",
      "4. Programming\n",
      "5. Managing data, information and digital content\u001b[0m\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The competences of Jane Brown are:\\n1. Protecting the environment\\n2. Protecting health and well-being\\n3. Protecting personal data and privacy\\n4. Programming\\n5. Managing data, information and digital content'"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sql.run(\"What are the competences of Jane Brown?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "f248d5e8-6ea6-4c11-b5fb-4010b90e1b5d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new SQLDatabaseChain chain...\u001b[0m\n",
      "Which are the employees with competences similar to the ones of Jane Brown?\n",
      "SQLQuery:\u001b[32;1m\u001b[1;3mSELECT e.name, e.surname\n",
      "FROM employees e\n",
      "JOIN assignment a ON e.id = a.employee_id\n",
      "JOIN competences c ON a.competence_id = c.id\n",
      "WHERE e.surname = 'Brown' AND e.name != 'Jane'\n",
      "LIMIT 5;\u001b[0m\n",
      "SQLResult: \u001b[33;1m\u001b[1;3m[('David', 'Brown'), ('David', 'Brown'), ('David', 'Brown'), ('David', 'Brown'), ('David', 'Brown')]\u001b[0m\n",
      "Answer:\u001b[32;1m\u001b[1;3mFinal answer: The employees with competences similar to the ones of Jane Brown are David Brown.\u001b[0m\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Final answer: The employees with competences similar to the ones of Jane Brown are David Brown.'"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sql.run(\"Which are the employees with competences similar to the ones of Jane Brown?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "449629bb-fc78-46b3-a965-11ac56d93b92",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new SQLDatabaseChain chain...\u001b[0m\n",
      "Identify the name and surname of the employee that has the higher number of competences in common with Jane Brown? Exclude Jane Smith from the results\n",
      "SQLQuery:\u001b[32;1m\u001b[1;3mSELECT e.name, e.surname\n",
      "FROM employees e\n",
      "JOIN assignment a ON e.id = a.employee_id\n",
      "JOIN assignment a2 ON a.competence_id = a2.competence_id\n",
      "JOIN employees e2 ON a2.employee_id = e2.id\n",
      "WHERE e2.name = 'Jane' AND e2.surname = 'Brown' AND e.name <> 'Jane' AND e.surname <> 'Smith'\n",
      "GROUP BY e.name, e.surname\n",
      "ORDER BY COUNT(DISTINCT a.competence_id) DESC\n",
      "LIMIT 1;\u001b[0m\n",
      "SQLResult: \u001b[33;1m\u001b[1;3m[('David', 'Brown')]\u001b[0m\n",
      "Answer:\u001b[32;1m\u001b[1;3mDavid Brown\u001b[0m\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'David Brown'"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sql.run(\"Identify the name and surname of the employee that has the higher number of competences in common with Jane Brown? Exclude Jane Smith from the results\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "49412dc6-4428-4ead-a83e-802855f6752b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# NEO4J\n",
    "from langchain.chat_models import ChatOpenAI\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain.graphs import Neo4jGraph\n",
    "\n",
    "neo4j_graph = Neo4jGraph(\n",
    "    url=\"bolt://competence-kg-neo4j:7687\", username=\"neo4j\", password=\"kgCefriel\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "65c28a1a-d243-4c6e-9d6a-0b88a0c36a9a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "        Node properties are the following:\n",
      "        [{'labels': 'Competence', 'properties': [{'property': 'description', 'type': 'STRING'}, {'property': 'dimension', 'type': 'STRING'}, {'property': 'competenceId', 'type': 'STRING'}, {'property': 'name', 'type': 'STRING'}]}, {'labels': 'Employee', 'properties': [{'property': 'surname', 'type': 'STRING'}, {'property': 'employeeId', 'type': 'STRING'}, {'property': 'name', 'type': 'STRING'}]}, {'labels': 'Unit', 'properties': [{'property': 'name', 'type': 'STRING'}]}]\n",
      "        Relationship properties are the following:\n",
      "        [{'properties': [{'property': 'level', 'type': 'STRING'}], 'type': 'HAS_COMPETENCE'}]\n",
      "        The relationships are the following:\n",
      "        ['(:Employee)-[:HAS_INTEREST]->(:Competence)', '(:Employee)-[:BELONGS_TO]->(:Unit)', '(:Employee)-[:HAS_COMPETENCE]->(:Competence)']\n",
      "        \n"
     ]
    }
   ],
   "source": [
    "#graph.refresh_schema()\n",
    "print(neo4j_graph.get_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "34505bba-6e8b-4bad-862c-96247f6e1369",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_chain = GraphCypherQAChain.from_llm(\n",
    "    ChatOpenAI(temperature=0), graph=neo4j_graph, verbose=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "a1dcb1b8-b9bd-4b9a-999e-fc13e2bc5957",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (e:Employee {name: 'Jane', surname: 'Davis'})-[:HAS_COMPETENCE]->(c:Competence)\n",
      "RETURN c\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c': {'competenceId': '5.3', 'name': 'Creatively using digital technologies', 'description': 'To use digital tools and technologies to create knowledge and to innovate processes and products. To engage individually and collectively in cognitive processing to understand and resolve conceptual problems and problem situations in digital environments.', 'dimension': '2'}}, {'c': {'competenceId': '5.4', 'name': 'Identifying digital competence gaps', 'description': 'To understand where one’s own digital competence needs to be improved or updated. To be able to support others with their digital competence development. To seek opportunities for self-development and to keep up-to-date with the digital evolution.', 'dimension': '2'}}, {'c': {'competenceId': '2.3', 'name': 'Engaging in citizenship through digital technologies', 'description': 'To participate in society through the use of public and private digital services. To seek opportunities for self-empowerment and for participatory citizenship through appropriate digital technologies.', 'dimension': '2'}}, {'c': {'competenceId': '1.3', 'name': 'Managing data, information and digital content', 'description': 'To organise, store and retrieve data, information and content in digital environments. To organise and process them in a structured environment.', 'dimension': '2'}}, {'c': {'competenceId': '2.4', 'name': 'Collaborating through digital technologies', 'description': 'To use digital tools and technologies for collaborative processes, and for co-construction and co-creation of resources and knowledge.', 'dimension': '2'}}, {'c': {'competenceId': '1.2', 'name': 'Evaluating data, information and digital content', 'description': 'To analyse, compare and critically evaluate the credibility and reliability of sources of data, information and digital content. To analyse, interpret and critically evaluate the data, information and digital content.', 'dimension': '2'}}, {'c': {'competenceId': '2.6', 'name': 'Managing digital identity', 'description': \"To create and manage one or multiple digital identities, to be able to protect one's own reputation, to deal with the data that one produces through several digital tools, environments and services.\", 'dimension': '2'}}, {'c': {'competenceId': '2.2', 'name': 'Sharing through digital technologies', 'description': 'To share data, information and digital content with others through appropriate digital technologies. To act as an intermediary, to know about referencing and attribution practices.', 'dimension': '2'}}, {'c': {'competenceId': '4.1', 'name': 'Protecting devices', 'description': 'To protect devices and digital content, and to understand risks and threats in digital environments. To know about safety and security measures and to have due regard to reliability and privacy.', 'dimension': '2'}}, {'c': {'competenceId': '5.2', 'name': 'Identifying needs and technological responses', 'description': 'To assess needs and to identify, evaluate, select and use digital tools and possible technological responses to solve them. To adjust and customise digital environments to personal needs (e.g. accessibility).', 'dimension': '2'}}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"I'm sorry, but I don't have any information about the competences of Jane Davis.\""
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_chain.run(\"What are the competences of the employee with name Jane and surname Davis?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "ef13784c-056b-439e-9bc2-9ab132ebc588",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (e:Employee {name: 'Jane', surname: 'Brown'})-[:HAS_COMPETENCE]->(c:Competence)\n",
      "RETURN c.name\n",
      "LIMIT 5\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.name': 'Netiquette'}, {'c.name': 'Copyright and licences'}, {'c.name': 'Protecting personal data and privacy'}, {'c.name': 'Creatively using digital technologies'}, {'c.name': 'Interacting through digital technologies'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Jane Brown has 5 competences. They are Netiquette, Copyright and licences, Protecting personal data and privacy, Creatively using digital technologies, and Interacting through digital technologies.'"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_chain.run(\"What are 5 competences of Jane Brown?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "911e215a-28a8-4d69-9660-718b1ddec951",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (jane:Employee {name: 'Jane', surname: 'Smith'})-[:HAS_COMPETENCE]->(janeCompetence:Competence)\n",
      "MATCH (employee:Employee)-[:HAS_COMPETENCE]->(employeeCompetence:Competence)\n",
      "WHERE employee <> jane\n",
      "WITH employee, COUNT(DISTINCT employeeCompetence) AS commonCompetences\n",
      "ORDER BY commonCompetences DESC\n",
      "RETURN employee.name, employee.surname, commonCompetences\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'employee.name': 'Jane', 'employee.surname': 'Taylor', 'commonCompetences': 21}, {'employee.name': 'Jane', 'employee.surname': 'Davis', 'commonCompetences': 19}, {'employee.name': 'Sophia', 'employee.surname': 'Johnson', 'commonCompetences': 19}, {'employee.name': 'David', 'employee.surname': 'Brown', 'commonCompetences': 18}, {'employee.name': 'David', 'employee.surname': 'Davis', 'commonCompetences': 18}, {'employee.name': 'David', 'employee.surname': 'Miller', 'commonCompetences': 18}, {'employee.name': 'Daniel', 'employee.surname': 'Brown', 'commonCompetences': 17}, {'employee.name': 'Michael', 'employee.surname': 'Wilson', 'commonCompetences': 15}, {'employee.name': 'Emma', 'employee.surname': 'Johnson', 'commonCompetences': 14}, {'employee.name': 'Sophia', 'employee.surname': 'Harris', 'commonCompetences': 13}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The employees that have the higher number of competences in common with Jane Smith, excluding Jane Smith herself, are Sophia Johnson, David Brown, David Davis, and David Miller.'"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_chain.run(\"Identify the employees that have the higher number of competences in common with Jane Smith? Exclude Jane Smith from the results\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "15965ce4-19d1-4233-baec-d49765143851",
   "metadata": {},
   "outputs": [],
   "source": [
    "# RDF\n",
    "rdf_file = join(folder, \"rdf/knowledge-graph-enriched.ttl\")\n",
    "rdf_graph = RdfGraph(\n",
    "    source_file=rdf_file,\n",
    "    standard=\"rdf\",\n",
    "    serialization= \"ttl\",\n",
    "    local_copy=rdf_file,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "700add07-d9f9-49f4-8dc5-810ca98c83bd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "In the following, each IRI is followed by the local name and optionally its description in parentheses. \n",
      "The RDF graph supports the following node types:\n",
      "<https://knowledge.c-innovationhub.com/competence-kg/schema#EmployeeCompetence> (EmployeeCompetence, None), <http://www.w3.org/2004/02/skos/core#Concept> (Concept, None), <http://www.w3.org/2008/05/skos-xl#Label> (Label, None), <http://publications.europa.eu/ontology/euvoc#XlNotation> (XlNotation, None), <http://publications.europa.eu/ontology/euvoc#XlNote> (XlNote, None), <http://xmlns.com/foaf/0.1/Person> (Person, None), <https://knowledge.c-innovationhub.com/competence-kg/schema#Employee> (Employee, None), <http://xmlns.com/foaf/0.1/Group> (Group, None), <https://knowledge.c-innovationhub.com/competence-kg/schema#Competence> (Competence, None), <http://www.w3.org/2004/02/skos/core#ConceptScheme> (ConceptScheme, None)\n",
      "The RDF graph supports the following relationships:\n",
      "<http://publications.europa.eu/ontology/euvoc#startDate> (startDate, None), <http://purl.org/dc/terms/type> (type, None), <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> (type, None), <https://knowledge.c-innovationhub.com/competence-kg/schema#hasInterest> (hasInterest, None), <http://purl.org/dc/terms/created> (created, None), <https://knowledge.c-innovationhub.com/competence-kg/schema#hasAssignedCompetence> (hasAssignedCompetence, None), <http://www.w3.org/2004/02/skos/core#notation> (notation, None), <http://www.w3.org/2004/02/skos/core#prefLabel> (prefLabel, None), <http://www.w3.org/2008/05/skos-xl#literalForm> (literalForm, None), <http://www.w3.org/1999/02/22-rdf-syntax-ns#value> (value, None), <http://www.w3.org/2008/05/skos-xl#prefLabel> (prefLabel, None), <http://publications.europa.eu/ontology/euvoc#status> (status, None), <https://knowledge.c-innovationhub.com/competence-kg/schema#hasCompetenceLevel> (hasCompetenceLevel, None), <http://www.w3.org/2004/02/skos/core#closeMatch> (closeMatch, None), <http://www.w3.org/2004/02/skos/core#narrower> (narrower, None), <http://www.w3.org/2002/07/owl#versionInfo> (versionInfo, None), <http://publications.europa.eu/ontology/euvoc#xlDefinition> (xlDefinition, None), <http://www.w3.org/2004/02/skos/core#altLabel> (altLabel, None), <http://publications.europa.eu/ontology/euvoc#xlNotation> (xlNotation, None), <https://knowledge.c-innovationhub.com/competence-kg/schema#isAssignedToEmployee> (isAssignedToEmployee, None), <http://www.w3.org/2004/02/skos/core#broader> (broader, None), <http://www.w3.org/2004/02/skos/core#definition> (definition, None), <http://www.w3.org/2008/05/skos-xl#altLabel> (altLabel, None), <http://xmlns.com/foaf/0.1/member> (member, None), <http://xmlns.com/foaf/0.1/surname> (surname, None), <http://purl.org/dc/terms/modified> (modified, None), <http://www.w3.org/2004/02/skos/core#inScheme> (inScheme, None), <http://purl.org/dc/elements/1.1/identifier> (identifier, None), <http://www.w3.org/2004/02/skos/core#example> (example, None), <http://xmlns.com/foaf/0.1/name> (name, None), <http://publications.europa.eu/ontology/euvoc#xlExample> (xlExample, None), <http://xmlns.com/foaf/0.1/title> (title, None), <http://www.w3.org/2004/02/skos/core#topConceptOf> (topConceptOf, None), <http://www.w3.org/2004/02/skos/core#hasTopConcept> (hasTopConcept, None), <http://purl.org/dc/terms/identifier> (identifier, None), <http://purl.org/dc/terms/title> (title, None), <http://purl.org/dc/terms/issued> (issued, None)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# graph.load_schema()\n",
    "print(rdf_graph.get_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "d9497f06-9e63-408b-8715-9e843ec4e8c9",
   "metadata": {},
   "outputs": [],
   "source": [
    "chain_sparql = GraphSparqlQAChain.from_llm(\n",
    "    ChatOpenAI(temperature=0), graph=rdf_graph, verbose=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "66f353d9-03d0-4280-a7a0-771f1fcdfec3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "SELECT ?surname\n",
      "WHERE {\n",
      "    ?person foaf:name \"Jane\" .\n",
      "    ?person foaf:surname ?surname .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[(rdflib.term.Literal('Smith'),), (rdflib.term.Literal('Brown'),), (rdflib.term.Literal('Davis'),), (rdflib.term.Literal('Taylor'),)]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The surnames of the employees named Jane are Smith, Brown, Davis, and Taylor.'"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run(\"What are the surnames of the employees named Jane\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "e273efc4-67fa-4932-96ad-e9ab2a703af3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX schema: <https://knowledge.c-innovationhub.com/competence-kg/schema#>\n",
      "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "\n",
      "SELECT ?competence\n",
      "WHERE {\n",
      "    ?employee foaf:name \"Jane Brown\" .\n",
      "    ?employee schema:hasAssignedCompetence ?competence .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Jane Brown has the following competences: [competence 1], [competence 2], [competence 3], and [competence 4].'"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run(\"What are the competences of Jane Brown?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "2cae1cee-f8a3-412d-942c-a64235e0a094",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX schema: <https://knowledge.c-innovationhub.com/competence-kg/schema#>\n",
      "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "\n",
      "SELECT ?competence\n",
      "WHERE {\n",
      "    ?employee foaf:name \"Jane\" .\n",
      "    ?employee foaf:surname \"Smith\" .\n",
      "    ?employee schema:isAssignedToEmployee ?employeeCompetence .\n",
      "    ?employeeCompetence schema:hasAssignedCompetence ?competence .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The employee competences of Jane Smith are not available in the provided information.'"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run(\"List the employee competences of the employee with name Jane and surname Smith\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "150030c0-fccd-4007-a633-d615d0958fc4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
      "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
      "PREFIX owl:  <http://www.w3.org/2002/07/owl#>\n",
      "PREFIX dct: <http://purl.org/dc/terms/>\n",
      "PREFIX ckg:  <https://knowledge.c-innovationhub.com/competence-kg/schema#>\n",
      "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "PREFIX xsd:  <http://www.w3.org/2001/XMLSchema#>\n",
      "\n",
      "SELECT ?competenceLabel\n",
      "WHERE {\n",
      "    ?employee rdf:type ckg:Employee .\n",
      "    ?employee foaf:name \"Jane\" .\n",
      "    ?employee foaf:surname \"Brown\" .\n",
      "    ?employeeCompetence rdf:type ckg:EmployeeCompetence .\n",
      "    ?employeeCompetence ckg:isAssignedToEmployee ?employee .\n",
      "    ?employeeCompetence ckg:hasAssignedCompetence ?competence .\n",
      "    ?competence skos:prefLabel ?competenceLabel .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[(rdflib.term.Literal('3.4 Programming', lang='en'),), (rdflib.term.Literal('5.1 Solving technical problems', lang='en'),), (rdflib.term.Literal('4.2 Protecting personal data and privacy', lang='en'),), (rdflib.term.Literal('3.3 Copyright and licences', lang='en'),), (rdflib.term.Literal('5.3 Creatively using digital technologies', lang='en'),), (rdflib.term.Literal('1.3 Managing data, information and digital content', lang='en'),), (rdflib.term.Literal('2.1 Interacting through digital technologies', lang='en'),), (rdflib.term.Literal('2.5 Netiquette', lang='en'),), (rdflib.term.Literal('4.3 Protecting health and well-being', lang='en'),), (rdflib.term.Literal('4.4 Protecting the environment', lang='en'),)]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The assignments of competences to the employee with the name Jane and surname Brown are as follows:\\n\\n1. Competence: 3.4 Programming\\n   Preferred Label: Programming\\n\\n2. Competence: 5.1 Solving technical problems\\n   Preferred Label: Solving technical problems\\n\\n3. Competence: 4.2 Protecting personal data and privacy\\n   Preferred Label: Protecting personal data and privacy\\n\\n4. Competence: 3.3 Copyright and licences\\n   Preferred Label: Copyright and licences\\n\\n5. Competence: 5.3 Creatively using digital technologies\\n   Preferred Label: Creatively using digital technologies\\n\\n6. Competence: 1.3 Managing data, information and digital content\\n   Preferred Label: Managing data, information and digital content\\n\\n7. Competence: 2.1 Interacting through digital technologies\\n   Preferred Label: Interacting through digital technologies\\n\\n8. Competence: 2.5 Netiquette\\n   Preferred Label: Netiquette\\n\\n9. Competence: 4.3 Protecting health and well-being\\n   Preferred Label: Protecting health and well-being\\n\\n10. Competence: 4.4 Protecting the environment\\n    Preferred Label: Protecting the environment'"
      ]
     },
     "execution_count": 69,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run('''Extract the assignments of competences to the employee with name Jane and surname Brown\n",
    "and provide the preferred label associated with each competence? Consider that the data are modelled \n",
    "using the following ontology in Turtle:\n",
    "\n",
    "```\n",
    "@prefix rdf:  <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
    "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
    "@prefix owl:  <http://www.w3.org/2002/07/owl#> .\n",
    "@prefix dct: <http://purl.org/dc/terms/> .\n",
    "@prefix ckg:  <https://knowledge.c-innovationhub.com/competence-kg/schema#> .\n",
    "@prefix foaf: <http://xmlns.com/foaf/0.1/> .\n",
    "@prefix xsd:  <http://www.w3.org/2001/XMLSchema#> .\n",
    "\n",
    "ckg:Competence a owl:Class ;\n",
    "\trdfs:label \"Competence\" .\n",
    "\n",
    "ckg:Employee a owl:Class ;\n",
    "\trdfs:label \"Employee\" ;\n",
    "\trdfs:subClassOf foaf:Person .\n",
    "\n",
    "skos:prefLabel a owl:DatatypeProperty .\n",
    "\t\n",
    "ckg:EmployeeCompetence a owl:Class ;\n",
    "\trdfs:label \"Assignment of a Competence to an Employee\" .\n",
    "\t\n",
    "ckg:hasAssignedCompetence a owl:ObjectProperty ;  \n",
    "\trdfs:label \"has competence assigned to employee\" ;\n",
    "\trdfs:domain ckg:EmployeeCompetence ;\n",
    "\trdfs:range ckg:Competence .\n",
    "\n",
    "ckg:isAssignedToEmployee a owl:ObjectProperty ;\n",
    "\trdfs:label \"is assigned to employee\" ;\n",
    "\trdfs:domain ckg:EmployeeCompetence ;\n",
    "\trdfs:range ckg:Employee .\n",
    "\n",
    "ckg:hasInterest a owl:DatatypeProperty ; \n",
    "\trdfs:label \"interest of the employee in the competence\" ;\n",
    "\trdfs:domain ckg:EmployeeCompetence ;\n",
    "\trdfs:range xsd:boolean .\n",
    "\n",
    "ckg:hasCompetenceLevel a owl:DatatypeProperty ;  \n",
    "\trdfs:label \"level of competence for the employee\" ;\n",
    "\trdfs:domain ckg:EmployeeCompetence ;\n",
    "\trdfs:range xsd:int .\n",
    "```\n",
    "''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "93e96128-ae2b-4288-99a2-7895f40a946b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "PREFIX schema: <https://knowledge.c-innovationhub.com/competence-kg/schema#>\n",
      "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
      "\n",
      "SELECT ?competenceLabel\n",
      "WHERE {\n",
      "    ?employee foaf:name \"Jane\" .\n",
      "    ?employee foaf:surname \"Brown\" .\n",
      "    ?employee schema:hasAssignedCompetence ?competence .\n",
      "    ?competence skos:prefLabel ?competenceLabel .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The assignments of competences to the employee named Jane Brown are as follows:\\n\\n1. Competence 1: Preferred label - Label 1\\n2. Competence 2: Preferred label - Label 2\\n3. Competence 3: Preferred label - Label 3\\n\\nThese are the competences that have been assigned to Jane Brown, along with their respective preferred labels.'"
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run('''Extract the assignments of competences to the employee with name Jane and surname Brown and provide the preferred label associated with each competence?\n",
    "''')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b54b5bd3-2868-4ff2-91e0-0e9a25ab0b80",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
