{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "02c30e4b-4cca-4698-9401-627c1750acde",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting langchain\n",
      "  Obtaining dependency information for langchain from https://files.pythonhosted.org/packages/e5/9c/a5198e803c6525c7e4f92e474cdc97cbecf63d862db5e4def5bbb00fb17f/langchain-0.0.319-py3-none-any.whl.metadata\n",
      "  Downloading langchain-0.0.319-py3-none-any.whl.metadata (15 kB)\n",
      "Collecting openai\n",
      "  Obtaining dependency information for openai from https://files.pythonhosted.org/packages/1e/9f/385c25502f437686e4aa715969e5eaf5c2cb5e5ffa7c5cdd52f3c6ae967a/openai-0.28.1-py3-none-any.whl.metadata\n",
      "  Downloading openai-0.28.1-py3-none-any.whl.metadata (11 kB)\n",
      "Collecting rdflib\n",
      "  Obtaining dependency information for rdflib from https://files.pythonhosted.org/packages/d4/b0/7b7d8b5b0d01f1a0b12cc2e5038a868ef3a15825731b8a0d776cf47566c0/rdflib-7.0.0-py3-none-any.whl.metadata\n",
      "  Downloading rdflib-7.0.0-py3-none-any.whl.metadata (11 kB)\n",
      "Collecting neo4j==5.0.1\n",
      "  Downloading neo4j-5.0.1.tar.gz (172 kB)\n",
      "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m172.4/172.4 kB\u001b[0m \u001b[31m3.5 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n",
      "\u001b[?25h  Preparing metadata (setup.py) ... \u001b[?25ldone\n",
      "\u001b[?25hCollecting psycopg2-binary\n",
      "  Obtaining dependency information for psycopg2-binary from https://files.pythonhosted.org/packages/ce/85/62825cabc6aad53104b7b6d12eb2ad74737d268630032d07b74d4444cb72/psycopg2_binary-2.9.9-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata\n",
      "  Downloading psycopg2_binary-2.9.9-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (4.4 kB)\n",
      "Requirement already satisfied: pytz in /opt/conda/lib/python3.11/site-packages (from neo4j==5.0.1) (2023.3)\n",
      "Requirement already satisfied: PyYAML>=5.3 in /opt/conda/lib/python3.11/site-packages (from langchain) (6.0)\n",
      "Requirement already satisfied: SQLAlchemy<3,>=1.4 in /opt/conda/lib/python3.11/site-packages (from langchain) (2.0.19)\n",
      "Requirement already satisfied: aiohttp<4.0.0,>=3.8.3 in /opt/conda/lib/python3.11/site-packages (from langchain) (3.8.4)\n",
      "Requirement already satisfied: anyio<4.0 in /opt/conda/lib/python3.11/site-packages (from langchain) (3.7.1)\n",
      "Collecting dataclasses-json<0.7,>=0.5.7 (from langchain)\n",
      "  Obtaining dependency information for dataclasses-json<0.7,>=0.5.7 from https://files.pythonhosted.org/packages/21/1f/1cff009cff64420572b9f75b70e4a054095719179a172297dfdd65843162/dataclasses_json-0.6.1-py3-none-any.whl.metadata\n",
      "  Downloading dataclasses_json-0.6.1-py3-none-any.whl.metadata (24 kB)\n",
      "Collecting jsonpatch<2.0,>=1.33 (from langchain)\n",
      "  Obtaining dependency information for jsonpatch<2.0,>=1.33 from https://files.pythonhosted.org/packages/73/07/02e16ed01e04a374e644b575638ec7987ae846d25ad97bcc9945a3ee4b0e/jsonpatch-1.33-py2.py3-none-any.whl.metadata\n",
      "  Downloading jsonpatch-1.33-py2.py3-none-any.whl.metadata (3.0 kB)\n",
      "Collecting langsmith<0.1.0,>=0.0.43 (from langchain)\n",
      "  Obtaining dependency information for langsmith<0.1.0,>=0.0.43 from https://files.pythonhosted.org/packages/45/83/889e832d1565b4cb59f0a2ff08aeb6d1c12cfa77f0686b06d46beb5f1440/langsmith-0.0.47-py3-none-any.whl.metadata\n",
      "  Downloading langsmith-0.0.47-py3-none-any.whl.metadata (10 kB)\n",
      "Requirement already satisfied: numpy<2,>=1 in /opt/conda/lib/python3.11/site-packages (from langchain) (1.24.4)\n",
      "Collecting pydantic<3,>=1 (from langchain)\n",
      "  Obtaining dependency information for pydantic<3,>=1 from https://files.pythonhosted.org/packages/73/66/0a72c9fcde42e5650c8d8d5c5c1873b9a3893018020c77ca8eb62708b923/pydantic-2.4.2-py3-none-any.whl.metadata\n",
      "  Downloading pydantic-2.4.2-py3-none-any.whl.metadata (158 kB)\n",
      "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m158.6/158.6 kB\u001b[0m \u001b[31m3.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n",
      "\u001b[?25hRequirement already satisfied: requests<3,>=2 in /opt/conda/lib/python3.11/site-packages (from langchain) (2.31.0)\n",
      "Collecting tenacity<9.0.0,>=8.1.0 (from langchain)\n",
      "  Obtaining dependency information for tenacity<9.0.0,>=8.1.0 from https://files.pythonhosted.org/packages/f4/f1/990741d5bb2487d529d20a433210ffa136a367751e454214013b441c4575/tenacity-8.2.3-py3-none-any.whl.metadata\n",
      "  Downloading tenacity-8.2.3-py3-none-any.whl.metadata (1.0 kB)\n",
      "Requirement already satisfied: tqdm in /opt/conda/lib/python3.11/site-packages (from openai) (4.65.0)\n",
      "Collecting isodate<0.7.0,>=0.6.0 (from rdflib)\n",
      "  Downloading isodate-0.6.1-py2.py3-none-any.whl (41 kB)\n",
      "\u001b[2K     \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m41.7/41.7 kB\u001b[0m \u001b[31m4.2 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
      "\u001b[?25hRequirement already satisfied: pyparsing<4,>=2.1.0 in /opt/conda/lib/python3.11/site-packages (from rdflib) (3.0.9)\n",
      "Requirement already satisfied: attrs>=17.3.0 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (23.1.0)\n",
      "Requirement already satisfied: charset-normalizer<4.0,>=2.0 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (3.2.0)\n",
      "Requirement already satisfied: multidict<7.0,>=4.5 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (6.0.4)\n",
      "Requirement already satisfied: async-timeout<5.0,>=4.0.0a3 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (4.0.2)\n",
      "Requirement already satisfied: yarl<2.0,>=1.0 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (1.9.2)\n",
      "Requirement already satisfied: frozenlist>=1.1.1 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (1.4.0)\n",
      "Requirement already satisfied: aiosignal>=1.1.2 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain) (1.3.1)\n",
      "Requirement already satisfied: idna>=2.8 in /opt/conda/lib/python3.11/site-packages (from anyio<4.0->langchain) (3.4)\n",
      "Requirement already satisfied: sniffio>=1.1 in /opt/conda/lib/python3.11/site-packages (from anyio<4.0->langchain) (1.3.0)\n",
      "Collecting marshmallow<4.0.0,>=3.18.0 (from dataclasses-json<0.7,>=0.5.7->langchain)\n",
      "  Obtaining dependency information for marshmallow<4.0.0,>=3.18.0 from https://files.pythonhosted.org/packages/ed/3c/cebfdcad015240014ff08b883d1c0c427f2ba45ae8c6572851b6ef136cad/marshmallow-3.20.1-py3-none-any.whl.metadata\n",
      "  Downloading marshmallow-3.20.1-py3-none-any.whl.metadata (7.8 kB)\n",
      "Collecting typing-inspect<1,>=0.4.0 (from dataclasses-json<0.7,>=0.5.7->langchain)\n",
      "  Obtaining dependency information for typing-inspect<1,>=0.4.0 from https://files.pythonhosted.org/packages/65/f3/107a22063bf27bdccf2024833d3445f4eea42b2e598abfbd46f6a63b6cb0/typing_inspect-0.9.0-py3-none-any.whl.metadata\n",
      "  Downloading typing_inspect-0.9.0-py3-none-any.whl.metadata (1.5 kB)\n",
      "Requirement already satisfied: six in /opt/conda/lib/python3.11/site-packages (from isodate<0.7.0,>=0.6.0->rdflib) (1.16.0)\n",
      "Requirement already satisfied: jsonpointer>=1.9 in /opt/conda/lib/python3.11/site-packages (from jsonpatch<2.0,>=1.33->langchain) (2.0)\n",
      "Collecting annotated-types>=0.4.0 (from pydantic<3,>=1->langchain)\n",
      "  Obtaining dependency information for annotated-types>=0.4.0 from https://files.pythonhosted.org/packages/28/78/d31230046e58c207284c6b2c4e8d96e6d3cb4e52354721b944d3e1ee4aa5/annotated_types-0.6.0-py3-none-any.whl.metadata\n",
      "  Downloading annotated_types-0.6.0-py3-none-any.whl.metadata (12 kB)\n",
      "Collecting pydantic-core==2.10.1 (from pydantic<3,>=1->langchain)\n",
      "  Obtaining dependency information for pydantic-core==2.10.1 from https://files.pythonhosted.org/packages/39/09/120c06a52ed4bb1022d060bec0a16e5deb4ce79a1c4c11ef9519bc32b59f/pydantic_core-2.10.1-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata\n",
      "  Downloading pydantic_core-2.10.1-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (6.5 kB)\n",
      "Requirement already satisfied: typing-extensions>=4.6.1 in /opt/conda/lib/python3.11/site-packages (from pydantic<3,>=1->langchain) (4.7.1)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/conda/lib/python3.11/site-packages (from requests<3,>=2->langchain) (2.0.3)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in /opt/conda/lib/python3.11/site-packages (from requests<3,>=2->langchain) (2023.5.7)\n",
      "Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.11/site-packages (from SQLAlchemy<3,>=1.4->langchain) (2.0.2)\n",
      "Requirement already satisfied: packaging>=17.0 in /opt/conda/lib/python3.11/site-packages (from marshmallow<4.0.0,>=3.18.0->dataclasses-json<0.7,>=0.5.7->langchain) (23.1)\n",
      "Collecting mypy-extensions>=0.3.0 (from typing-inspect<1,>=0.4.0->dataclasses-json<0.7,>=0.5.7->langchain)\n",
      "  Downloading mypy_extensions-1.0.0-py3-none-any.whl (4.7 kB)\n",
      "Downloading langchain-0.0.319-py3-none-any.whl (1.9 MB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m1.9/1.9 MB\u001b[0m \u001b[31m7.1 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m00:01\u001b[0m00:01\u001b[0m\n",
      "\u001b[?25hDownloading openai-0.28.1-py3-none-any.whl (76 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m77.0/77.0 kB\u001b[0m \u001b[31m2.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
      "\u001b[?25hDownloading rdflib-7.0.0-py3-none-any.whl (531 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m531.9/531.9 kB\u001b[0m \u001b[31m5.7 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m00:01\u001b[0m00:01\u001b[0m\n",
      "\u001b[?25hDownloading psycopg2_binary-2.9.9-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (3.0 MB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m3.0/3.0 MB\u001b[0m \u001b[31m7.0 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m00:01\u001b[0m00:01\u001b[0m\n",
      "\u001b[?25hDownloading dataclasses_json-0.6.1-py3-none-any.whl (27 kB)\n",
      "Downloading jsonpatch-1.33-py2.py3-none-any.whl (12 kB)\n",
      "Downloading langsmith-0.0.47-py3-none-any.whl (41 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m41.0/41.0 kB\u001b[0m \u001b[31m6.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
      "\u001b[?25hDownloading pydantic-2.4.2-py3-none-any.whl (395 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m395.8/395.8 kB\u001b[0m \u001b[31m6.3 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0ma \u001b[36m0:00:01\u001b[0m\n",
      "\u001b[?25hDownloading pydantic_core-2.10.1-cp311-cp311-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (2.0 MB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m2.0/2.0 MB\u001b[0m \u001b[31m7.3 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m00:01\u001b[0m00:01\u001b[0mm\n",
      "\u001b[?25hDownloading tenacity-8.2.3-py3-none-any.whl (24 kB)\n",
      "Downloading annotated_types-0.6.0-py3-none-any.whl (12 kB)\n",
      "Downloading marshmallow-3.20.1-py3-none-any.whl (49 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m49.4/49.4 kB\u001b[0m \u001b[31m6.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
      "\u001b[?25hDownloading typing_inspect-0.9.0-py3-none-any.whl (8.8 kB)\n",
      "Building wheels for collected packages: neo4j\n",
      "  Building wheel for neo4j (setup.py) ... \u001b[?25ldone\n",
      "\u001b[?25h  Created wheel for neo4j: filename=neo4j-5.0.1-py3-none-any.whl size=247362 sha256=155351610341a38ce71c4e95a5e8300e50034a51b669c742cdd5539810202156\n",
      "  Stored in directory: /home/jovyan/.cache/pip/wheels/c2/33/c6/fa22720f17810f856b71d7a5bfb579f56f6eb1fc00ba00262a\n",
      "Successfully built neo4j\n",
      "Installing collected packages: tenacity, pydantic-core, psycopg2-binary, neo4j, mypy-extensions, marshmallow, jsonpatch, isodate, annotated-types, typing-inspect, rdflib, pydantic, openai, langsmith, dataclasses-json, langchain\n",
      "  Attempting uninstall: jsonpatch\n",
      "    Found existing installation: jsonpatch 1.32\n",
      "    Uninstalling jsonpatch-1.32:\n",
      "      Successfully uninstalled jsonpatch-1.32\n",
      "Successfully installed annotated-types-0.6.0 dataclasses-json-0.6.1 isodate-0.6.1 jsonpatch-1.33 langchain-0.0.319 langsmith-0.0.47 marshmallow-3.20.1 mypy-extensions-1.0.0 neo4j-5.0.1 openai-0.28.1 psycopg2-binary-2.9.9 pydantic-2.4.2 pydantic-core-2.10.1 rdflib-7.0.0 tenacity-8.2.3 typing-inspect-0.9.0\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "!{sys.executable} -m pip install langchain openai rdflib neo4j==5.0.1 psycopg2-binary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "67c8816d-1782-49b9-addc-7d4110cb8e2e",
   "metadata": {},
   "outputs": [],
   "source": [
    "from os import getcwd\n",
    "from os.path import join, dirname\n",
    "folder = dirname(getcwd())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "54f31dd1-f869-476b-96d0-a40690a57d28",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import json\n",
    "\n",
    "credentials = join(folder, \"credentials.json\")\n",
    "with open(credentials) as f:\n",
    "    data = json.load(f)\n",
    "    key = data['OPENAI_API_KEY']\n",
    "    \n",
    "os.environ['OPENAI_API_KEY'] = key"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "15965ce4-19d1-4233-baec-d49765143851",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chat_models import ChatOpenAI\n",
    "from langchain.chains import GraphSparqlQAChain\n",
    "from langchain.graphs import RdfGraph\n",
    "\n",
    "rdf_file = join(folder, \"rdf/knowledge-graph.ttl\")\n",
    "rdf_graph = RdfGraph(\n",
    "    source_file=rdf_file,\n",
    "    standard=\"rdf\",\n",
    "    serialization= \"ttl\",\n",
    "    local_copy=rdf_file,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "700add07-d9f9-49f4-8dc5-810ca98c83bd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "In the following, each IRI is followed by the local name and optionally its description in parentheses. \n",
      "The RDF graph supports the following node types:\n",
      "<http://www.cefriel.com/corso-kg/schema/Competence> (Competence, None), <http://www.cefriel.com/corso-kg/schema/EmployeeCompetence> (EmployeeCompetence, None), <http://www.cefriel.com/corso-kg/schema/Employee> (Employee, None), <http://xmlns.com/foaf/0.1/Person> (Person, None), <http://xmlns.com/foaf/0.1/Group> (Group, None)\n",
      "The RDF graph supports the following relationships:\n",
      "<http://www.cefriel.com/corso-kg/schema/employee> (employee, None), <http://xmlns.com/foaf/0.1/member> (member, None), <http://xmlns.com/foaf/0.1/name> (name, None), <http://www.cefriel.com/corso-kg/schema/competence> (competence, None), <http://www.cefriel.com/corso-kg/schema/level> (level, None), <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> (type, None), <http://xmlns.com/foaf/0.1/surname> (surname, None), <http://xmlns.com/foaf/0.1/title> (title, None)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# graph.load_schema()\n",
    "print(rdf_graph.get_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "d9497f06-9e63-408b-8715-9e843ec4e8c9",
   "metadata": {},
   "outputs": [],
   "source": [
    "chain_sparql = GraphSparqlQAChain.from_llm(\n",
    "    ChatOpenAI(temperature=0), graph=rdf_graph, verbose=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "66f353d9-03d0-4280-a7a0-771f1fcdfec3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "SELECT ?surname\n",
      "WHERE {\n",
      "    ?person foaf:name \"Jane\" .\n",
      "    ?person foaf:surname ?surname .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[(rdflib.term.Literal('Brown'),), (rdflib.term.Literal('Taylor'),), (rdflib.term.Literal('Brown'),), (rdflib.term.Literal('Smith'),), (rdflib.term.Literal('Miller'),)]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The surnames of the employees named Jane are Brown, Taylor, Brown, Smith, and Miller.'"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run(\"What are the surnames of the employees named Jane\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "e273efc4-67fa-4932-96ad-e9ab2a703af3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX schema: <http://www.cefriel.com/corso-kg/schema/>\n",
      "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "\n",
      "SELECT ?competence\n",
      "WHERE {\n",
      "    ?employee foaf:name \"Jane Smith\" .\n",
      "    ?employee schema:employee ?employeeCompetence .\n",
      "    ?employeeCompetence schema:competence ?competence .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Jane Smith has the following competences: [competence 1], [competence 2], [competence 3], and so on.'"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run(\"List the competences of Jane Smith\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "2cae1cee-f8a3-412d-942c-a64235e0a094",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX cefriel: <http://www.cefriel.com/corso-kg/schema/>\n",
      "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "\n",
      "SELECT ?competence\n",
      "WHERE {\n",
      "    ?employee foaf:name \"Jane\" .\n",
      "    ?employee foaf:surname \"Smith\" .\n",
      "    ?employee cefriel:employeeCompetence ?employeeCompetence .\n",
      "    ?employeeCompetence cefriel:competence ?competence .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The employee competences of Jane Smith are not available in the provided information.'"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run(\"List the employee competences of the employee with name Jane and surname Smith\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "150030c0-fccd-4007-a633-d615d0958fc4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "PREFIX schema: <http://www.cefriel.com/corso-kg/schema/>\n",
      "\n",
      "SELECT ?competence\n",
      "WHERE {\n",
      "    ?employee foaf:name \"Jane\" .\n",
      "    ?employee foaf:surname \"Smith\" .\n",
      "    ?employeeCompetence schema:employee ?employee .\n",
      "    ?employeeCompetence schema:competence ?competence .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[(rdflib.term.URIRef('http://data.europa.eu/snb/dcf/9i6ta81748'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/3h9eab1489'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/4s23kdq383'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/9a5d39t62b'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/1dz4n8r554'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/7d4t7002v7'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/u69o196gu6'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/sq0c9q6116'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/2mi55kl065'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/0690r7o8r2'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/aa985fr035'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/1b043jw49b'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/mg54my1580'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/13z458t54u'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/860966ekgo'),)]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The competences related to the employee with the name Jane and surname Smith through the EmployeeCompetence are as follows: \\n\\n- http://data.europa.eu/snb/dcf/9i6ta81748\\n- http://data.europa.eu/snb/dcf/3h9eab1489\\n- http://data.europa.eu/snb/dcf/4s23kdq383\\n- http://data.europa.eu/snb/dcf/9a5d39t62b\\n- http://data.europa.eu/snb/dcf/1dz4n8r554\\n- http://data.europa.eu/snb/dcf/7d4t7002v7\\n- http://data.europa.eu/snb/dcf/u69o196gu6\\n- http://data.europa.eu/snb/dcf/sq0c9q6116\\n- http://data.europa.eu/snb/dcf/2mi55kl065\\n- http://data.europa.eu/snb/dcf/0690r7o8r2\\n- http://data.europa.eu/snb/dcf/aa985fr035\\n- http://data.europa.eu/snb/dcf/1b043jw49b\\n- http://data.europa.eu/snb/dcf/mg54my1580\\n- http://data.europa.eu/snb/dcf/13z458t54u\\n- http://data.europa.eu/snb/dcf/860966ekgo'"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run(\"List the competences related to employee with name Jane and surname Smith through EmployeeCompetence\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "49412dc6-4428-4ead-a83e-802855f6752b",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chat_models import ChatOpenAI\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain.graphs import Neo4jGraph\n",
    "\n",
    "neo4j_graph = Neo4jGraph(\n",
    "    url=\"bolt://corso-kg-neo4j:7687\", username=\"neo4j\", password=\"kgCefriel\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "65c28a1a-d243-4c6e-9d6a-0b88a0c36a9a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "        Node properties are the following:\n",
      "        [{'properties': [{'property': 'competence', 'type': 'STRING'}, {'property': 'dimension', 'type': 'STRING'}, {'property': 'description', 'type': 'STRING'}, {'property': 'competenceId', 'type': 'STRING'}], 'labels': 'Competence'}, {'properties': [{'property': 'surname', 'type': 'STRING'}, {'property': 'employeeId', 'type': 'STRING'}, {'property': 'name', 'type': 'STRING'}], 'labels': 'Employee'}, {'properties': [{'property': 'unitName', 'type': 'STRING'}], 'labels': 'Unit'}]\n",
      "        Relationship properties are the following:\n",
      "        [{'type': 'HAS_COMPETENCE', 'properties': [{'property': 'level', 'type': 'STRING'}]}]\n",
      "        The relationships are the following:\n",
      "        ['(:Employee)-[:INTERESTED_IN]->(:Competence)', '(:Employee)-[:IN_UNIT]->(:Unit)', '(:Employee)-[:HAS_COMPETENCE]->(:Competence)']\n",
      "        \n"
     ]
    }
   ],
   "source": [
    "#graph.refresh_schema()\n",
    "print(neo4j_graph.get_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "34505bba-6e8b-4bad-862c-96247f6e1369",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_chain = GraphCypherQAChain.from_llm(\n",
    "    ChatOpenAI(temperature=0), graph=neo4j_graph, verbose=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "a1dcb1b8-b9bd-4b9a-999e-fc13e2bc5957",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (e:Employee {name: 'Jane', surname: 'Smith'})-[:HAS_COMPETENCE]->(c:Competence)\n",
      "RETURN c.competence\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.competence': 'Managing data, information and digital content'}, {'c.competence': 'Protecting health and well-being'}, {'c.competence': 'Protecting the environment'}, {'c.competence': 'Protecting personal data and privacy'}, {'c.competence': 'Solving technical problems'}, {'c.competence': 'Identifying digital competence gaps'}, {'c.competence': 'Protecting devices'}, {'c.competence': 'Creatively using digital technologies'}, {'c.competence': 'Copyright and licences'}, {'c.competence': 'Browsing, searching and filtering data, information and digital content'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"I'm sorry, but I don't have any information about Jane Smith's competences.\""
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_chain.run(\"What are the competences of Jane Smith?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "911e215a-28a8-4d69-9660-718b1ddec951",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (jane:Employee {name: 'Jane', surname: 'Smith'})-[:INTERESTED_IN]->(janeCompetence:Competence)\n",
      "WITH jane, janeCompetence\n",
      "MATCH (employee:Employee)-[:INTERESTED_IN]->(employeeCompetence:Competence)\n",
      "WHERE employee <> jane\n",
      "WITH jane, janeCompetence, employee, employeeCompetence\n",
      "MATCH (employee)-[:HAS_COMPETENCE]->(commonCompetence:Competence)\n",
      "WHERE commonCompetence.competenceId = janeCompetence.competenceId\n",
      "RETURN employee.name, employee.surname, COUNT(commonCompetence) AS numCommonCompetences\n",
      "ORDER BY numCommonCompetences DESC\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'employee.name': 'Michael', 'employee.surname': 'Smith', 'numCommonCompetences': 102}, {'employee.name': 'Michael', 'employee.surname': 'Taylor', 'numCommonCompetences': 79}, {'employee.name': 'John', 'employee.surname': 'Smith', 'numCommonCompetences': 74}, {'employee.name': 'David', 'employee.surname': 'Brown', 'numCommonCompetences': 72}, {'employee.name': 'David', 'employee.surname': 'Wilson', 'numCommonCompetences': 70}, {'employee.name': 'John', 'employee.surname': 'Johnson', 'numCommonCompetences': 55}, {'employee.name': 'Olivia', 'employee.surname': 'Miller', 'numCommonCompetences': 55}, {'employee.name': 'Michael', 'employee.surname': 'Johnson', 'numCommonCompetences': 55}, {'employee.name': 'Daniel', 'employee.surname': 'Davis', 'numCommonCompetences': 50}, {'employee.name': 'Olivia', 'employee.surname': 'Johnson', 'numCommonCompetences': 50}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The employees that have the highest number of competences in common with Jane Smith, excluding Jane Smith herself, are Michael Smith with 102 common competences, Michael Taylor with 79 common competences, John Smith with 74 common competences, David Brown with 72 common competences, and David Wilson with 70 common competences.'"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_chain.run(\"Identify the employees that have the higher number of competences in common with Jane Smith? Exclude Jane Smith from the results\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "b8f0b1a1-a6aa-4a19-9cdf-8e83d46547f1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "CREATE TABLE assignment (\n",
      "\temployee_id TEXT, \n",
      "\tcompetence_id TEXT, \n",
      "\tlevel TEXT, \n",
      "\tinterest TEXT, \n",
      "\tCONSTRAINT assignment_competence_id_fkey FOREIGN KEY(competence_id) REFERENCES competences (id), \n",
      "\tCONSTRAINT assignment_employee_id_fkey FOREIGN KEY(employee_id) REFERENCES employees (id)\n",
      ")\n",
      "\n",
      "/*\n",
      "3 rows from assignment table:\n",
      "employee_id\tcompetence_id\tlevel\tinterest\n",
      "EMPLOYEE_1\t3.4\t5\t0\n",
      "EMPLOYEE_1\t2.1\t5\t0\n",
      "EMPLOYEE_1\t2.6\t5\t1\n",
      "*/\n",
      "\n",
      "\n",
      "CREATE TABLE competences (\n",
      "\tid TEXT NOT NULL, \n",
      "\tdimension TEXT, \n",
      "\tcompetence TEXT, \n",
      "\tdescription TEXT, \n",
      "\tCONSTRAINT competences_pkey PRIMARY KEY (id)\n",
      ")\n",
      "\n",
      "/*\n",
      "3 rows from competences table:\n",
      "id\tdimension\tcompetence\tdescription\n",
      "1\t1\tInformation and data literacy\tTo articulate information needs, to locate and retrieve digital data, information and content. To ju\n",
      "1.1\t2\tBrowsing, searching and filtering data, information and digital content\tTo articulate information needs , to search for data, information and content in digital environment\n",
      "1.2\t2\tEvaluating data, information and digital content\tTo analyse, compare and critically evaluate the credibility and reliability of sources of data, info\n",
      "*/\n",
      "\n",
      "\n",
      "CREATE TABLE employees (\n",
      "\tid TEXT NOT NULL, \n",
      "\tname TEXT, \n",
      "\tsurname TEXT, \n",
      "\tunit TEXT, \n",
      "\tCONSTRAINT employees_pkey PRIMARY KEY (id)\n",
      ")\n",
      "\n",
      "/*\n",
      "3 rows from employees table:\n",
      "id\tname\tsurname\tunit\n",
      "EMPLOYEE_1\tJane\tBrown\tOperations\n",
      "EMPLOYEE_2\tJohn\tWilson\tSales\n",
      "EMPLOYEE_3\tJohn\tDavis\tHuman Resources\n",
      "*/\n"
     ]
    }
   ],
   "source": [
    "from langchain import OpenAI, SQLDatabase, SQLDatabaseChain\n",
    "\n",
    "# Setup database\n",
    "database = \"corso-kg-postgres\"\n",
    "db = SQLDatabase.from_uri(\n",
    "    f\"postgresql+psycopg2://postgres:kgCefriel@corso-kg-postgres:5432/{database}\",\n",
    ")\n",
    "\n",
    "print(db.get_table_info())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "86fa5e2a-61fd-417f-b6fa-3c596664ecf7",
   "metadata": {},
   "outputs": [],
   "source": [
    "chain_sql = SQLDatabaseChain.from_llm(ChatOpenAI(temperature=0), db=db, verbose=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "b39e43af-c98b-423c-9530-f3e72e57630a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new SQLDatabaseChain chain...\u001b[0m\n",
      "What are the competences of Jane Smith?\n",
      "SQLQuery:\u001b[32;1m\u001b[1;3mSELECT c.competence\n",
      "FROM competences c\n",
      "JOIN assignment a ON c.id = a.competence_id\n",
      "JOIN employees e ON a.employee_id = e.id\n",
      "WHERE e.name = 'Jane' AND e.surname = 'Smith'\n",
      "LIMIT 5;\u001b[0m\n",
      "SQLResult: \u001b[33;1m\u001b[1;3m[('Managing digital identity',), ('Programming',), ('Solving technical problems',), ('Copyright and licences',), ('Protecting health and well-being',)]\u001b[0m\n",
      "Answer:\u001b[32;1m\u001b[1;3mThe competences of Jane Smith are:\n",
      "- Managing digital identity\n",
      "- Programming\n",
      "- Solving technical problems\n",
      "- Copyright and licences\n",
      "- Protecting health and well-being\u001b[0m\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The competences of Jane Smith are:\\n- Managing digital identity\\n- Programming\\n- Solving technical problems\\n- Copyright and licences\\n- Protecting health and well-being'"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sql.run(\"What are the competences of Jane Smith?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "f248d5e8-6ea6-4c11-b5fb-4010b90e1b5d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new SQLDatabaseChain chain...\u001b[0m\n",
      "Which are the employees with competences similar to the ones of Jane Smith?\n",
      "SQLQuery:\u001b[32;1m\u001b[1;3mSELECT e.name, e.surname\n",
      "FROM employees e\n",
      "JOIN assignment a ON e.id = a.employee_id\n",
      "JOIN competences c ON a.competence_id = c.id\n",
      "WHERE e.surname = 'Smith' AND e.name = 'Jane'\n",
      "LIMIT 5;\u001b[0m\n",
      "SQLResult: \u001b[33;1m\u001b[1;3m[('Jane', 'Smith'), ('Jane', 'Smith'), ('Jane', 'Smith'), ('Jane', 'Smith'), ('Jane', 'Smith')]\u001b[0m\n",
      "Answer:\u001b[32;1m\u001b[1;3mFinal answer: The employees with competences similar to Jane Smith are Jane Smith.\u001b[0m\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Final answer: The employees with competences similar to Jane Smith are Jane Smith.'"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sql.run(\"Which are the employees with competences similar to the ones of Jane Smith?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "449629bb-fc78-46b3-a965-11ac56d93b92",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new SQLDatabaseChain chain...\u001b[0m\n",
      "Identify the name and surname of the employee that has the higher number of competences in common with Jane Smith? Exclude Jane Smith from the results\n",
      "SQLQuery:\u001b[32;1m\u001b[1;3mSELECT e.name, e.surname\n",
      "FROM employees e\n",
      "JOIN assignment a ON e.id = a.employee_id\n",
      "JOIN competences c ON a.competence_id = c.id\n",
      "WHERE e.surname != 'Smith' AND e.name != 'Jane'\n",
      "AND a.competence_id IN (\n",
      "    SELECT competence_id\n",
      "    FROM assignment\n",
      "    WHERE employee_id = (\n",
      "        SELECT id\n",
      "        FROM employees\n",
      "        WHERE name = 'Jane' AND surname = 'Smith'\n",
      "    )\n",
      ")\n",
      "GROUP BY e.name, e.surname\n",
      "ORDER BY COUNT(DISTINCT a.competence_id) DESC\n",
      "LIMIT 1;\u001b[0m\n",
      "SQLResult: \u001b[33;1m\u001b[1;3m[('Daniel', 'Davis')]\u001b[0m\n",
      "Answer:\u001b[32;1m\u001b[1;3mDaniel Davis\u001b[0m\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Daniel Davis'"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sql.run(\"Identify the name and surname of the employee that has the higher number of competences in common with Jane Smith? Exclude Jane Smith from the results\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b54b5bd3-2868-4ff2-91e0-0e9a25ab0b80",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
