{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "02c30e4b-4cca-4698-9401-627c1750acde",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: langchain==0.0.320 in /opt/conda/lib/python3.11/site-packages (0.0.320)\n",
      "Collecting langchain_experimental==0.0.32\n",
      "  Obtaining dependency information for langchain_experimental==0.0.32 from https://files.pythonhosted.org/packages/3b/5c/e8fde17028deea571ffc53394ce9c9cb12246dd9c638edc629570c320544/langchain_experimental-0.0.32-py3-none-any.whl.metadata\n",
      "  Downloading langchain_experimental-0.0.32-py3-none-any.whl.metadata (1.8 kB)\n",
      "Requirement already satisfied: openai in /opt/conda/lib/python3.11/site-packages (0.28.1)\n",
      "Requirement already satisfied: rdflib in /opt/conda/lib/python3.11/site-packages (7.0.0)\n",
      "Requirement already satisfied: neo4j==5.0.1 in /opt/conda/lib/python3.11/site-packages (5.0.1)\n",
      "Requirement already satisfied: psycopg2-binary in /opt/conda/lib/python3.11/site-packages (2.9.9)\n",
      "Requirement already satisfied: PyYAML>=5.3 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (6.0)\n",
      "Requirement already satisfied: SQLAlchemy<3,>=1.4 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (2.0.19)\n",
      "Requirement already satisfied: aiohttp<4.0.0,>=3.8.3 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (3.8.4)\n",
      "Requirement already satisfied: anyio<4.0 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (3.7.1)\n",
      "Requirement already satisfied: dataclasses-json<0.7,>=0.5.7 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (0.6.1)\n",
      "Requirement already satisfied: jsonpatch<2.0,>=1.33 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (1.33)\n",
      "Requirement already satisfied: langsmith<0.1.0,>=0.0.43 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (0.0.49)\n",
      "Requirement already satisfied: numpy<2,>=1 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (1.24.4)\n",
      "Requirement already satisfied: pydantic<3,>=1 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (2.4.2)\n",
      "Requirement already satisfied: requests<3,>=2 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (2.31.0)\n",
      "Requirement already satisfied: tenacity<9.0.0,>=8.1.0 in /opt/conda/lib/python3.11/site-packages (from langchain==0.0.320) (8.2.3)\n",
      "Requirement already satisfied: pytz in /opt/conda/lib/python3.11/site-packages (from neo4j==5.0.1) (2023.3)\n",
      "Requirement already satisfied: tqdm in /opt/conda/lib/python3.11/site-packages (from openai) (4.65.0)\n",
      "Requirement already satisfied: isodate<0.7.0,>=0.6.0 in /opt/conda/lib/python3.11/site-packages (from rdflib) (0.6.1)\n",
      "Requirement already satisfied: pyparsing<4,>=2.1.0 in /opt/conda/lib/python3.11/site-packages (from rdflib) (3.0.9)\n",
      "Requirement already satisfied: attrs>=17.3.0 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (23.1.0)\n",
      "Requirement already satisfied: charset-normalizer<4.0,>=2.0 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (3.2.0)\n",
      "Requirement already satisfied: multidict<7.0,>=4.5 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (6.0.4)\n",
      "Requirement already satisfied: async-timeout<5.0,>=4.0.0a3 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (4.0.2)\n",
      "Requirement already satisfied: yarl<2.0,>=1.0 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (1.9.2)\n",
      "Requirement already satisfied: frozenlist>=1.1.1 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (1.4.0)\n",
      "Requirement already satisfied: aiosignal>=1.1.2 in /opt/conda/lib/python3.11/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain==0.0.320) (1.3.1)\n",
      "Requirement already satisfied: idna>=2.8 in /opt/conda/lib/python3.11/site-packages (from anyio<4.0->langchain==0.0.320) (3.4)\n",
      "Requirement already satisfied: sniffio>=1.1 in /opt/conda/lib/python3.11/site-packages (from anyio<4.0->langchain==0.0.320) (1.3.0)\n",
      "Requirement already satisfied: marshmallow<4.0.0,>=3.18.0 in /opt/conda/lib/python3.11/site-packages (from dataclasses-json<0.7,>=0.5.7->langchain==0.0.320) (3.20.1)\n",
      "Requirement already satisfied: typing-inspect<1,>=0.4.0 in /opt/conda/lib/python3.11/site-packages (from dataclasses-json<0.7,>=0.5.7->langchain==0.0.320) (0.9.0)\n",
      "Requirement already satisfied: six in /opt/conda/lib/python3.11/site-packages (from isodate<0.7.0,>=0.6.0->rdflib) (1.16.0)\n",
      "Requirement already satisfied: jsonpointer>=1.9 in /opt/conda/lib/python3.11/site-packages (from jsonpatch<2.0,>=1.33->langchain==0.0.320) (2.0)\n",
      "Requirement already satisfied: annotated-types>=0.4.0 in /opt/conda/lib/python3.11/site-packages (from pydantic<3,>=1->langchain==0.0.320) (0.6.0)\n",
      "Requirement already satisfied: pydantic-core==2.10.1 in /opt/conda/lib/python3.11/site-packages (from pydantic<3,>=1->langchain==0.0.320) (2.10.1)\n",
      "Requirement already satisfied: typing-extensions>=4.6.1 in /opt/conda/lib/python3.11/site-packages (from pydantic<3,>=1->langchain==0.0.320) (4.7.1)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in /opt/conda/lib/python3.11/site-packages (from requests<3,>=2->langchain==0.0.320) (2.0.3)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in /opt/conda/lib/python3.11/site-packages (from requests<3,>=2->langchain==0.0.320) (2023.5.7)\n",
      "Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.11/site-packages (from SQLAlchemy<3,>=1.4->langchain==0.0.320) (2.0.2)\n",
      "Requirement already satisfied: packaging>=17.0 in /opt/conda/lib/python3.11/site-packages (from marshmallow<4.0.0,>=3.18.0->dataclasses-json<0.7,>=0.5.7->langchain==0.0.320) (23.1)\n",
      "Requirement already satisfied: mypy-extensions>=0.3.0 in /opt/conda/lib/python3.11/site-packages (from typing-inspect<1,>=0.4.0->dataclasses-json<0.7,>=0.5.7->langchain==0.0.320) (1.0.0)\n",
      "Downloading langchain_experimental-0.0.32-py3-none-any.whl (151 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m151.6/151.6 kB\u001b[0m \u001b[31m7.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
      "\u001b[?25hInstalling collected packages: langchain_experimental\n",
      "Successfully installed langchain_experimental-0.0.32\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "!{sys.executable} -m pip install langchain==0.0.320 langchain_experimental==0.0.32 openai rdflib neo4j==5.0.1 psycopg2-binary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "67c8816d-1782-49b9-addc-7d4110cb8e2e",
   "metadata": {},
   "outputs": [],
   "source": [
    "from os import getcwd\n",
    "from os.path import join, dirname\n",
    "folder = dirname(getcwd())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "54f31dd1-f869-476b-96d0-a40690a57d28",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import json\n",
    "from langchain.chat_models import ChatOpenAI\n",
    "from langchain.chains import GraphSparqlQAChain\n",
    "from langchain.graphs import RdfGraph\n",
    "\n",
    "credentials = join(folder, \"credentials.json\")\n",
    "with open(credentials) as f:\n",
    "    data = json.load(f)\n",
    "    key = data['OPENAI_API_KEY']\n",
    "    \n",
    "os.environ['OPENAI_API_KEY'] = key"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "b8f0b1a1-a6aa-4a19-9cdf-8e83d46547f1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "CREATE TABLE assignment (\n",
      "\temployee_id TEXT, \n",
      "\tcompetence_id TEXT, \n",
      "\tlevel TEXT, \n",
      "\tinterest TEXT, \n",
      "\tCONSTRAINT assignment_competence_id_fkey FOREIGN KEY(competence_id) REFERENCES competences (id), \n",
      "\tCONSTRAINT assignment_employee_id_fkey FOREIGN KEY(employee_id) REFERENCES employees (id)\n",
      ")\n",
      "\n",
      "/*\n",
      "3 rows from assignment table:\n",
      "employee_id\tcompetence_id\tlevel\tinterest\n",
      "EMPLOYEE_1\t2.5\t2\t0\n",
      "EMPLOYEE_1\t2.1\t5\t0\n",
      "EMPLOYEE_1\t5.4\t4\t0\n",
      "*/\n",
      "\n",
      "\n",
      "CREATE TABLE competences (\n",
      "\tid TEXT NOT NULL, \n",
      "\tdimension TEXT, \n",
      "\tcompetence TEXT, \n",
      "\tdescription TEXT, \n",
      "\tCONSTRAINT competences_pkey PRIMARY KEY (id)\n",
      ")\n",
      "\n",
      "/*\n",
      "3 rows from competences table:\n",
      "id\tdimension\tcompetence\tdescription\n",
      "1\t1\tInformation and data literacy\tTo articulate information needs, to locate and retrieve digital data, information and content. To ju\n",
      "1.1\t2\tBrowsing, searching and filtering data, information and digital content\tTo articulate information needs , to search for data, information and content in digital environment\n",
      "1.2\t2\tEvaluating data, information and digital content\tTo analyse, compare and critically evaluate the credibility and reliability of sources of data, info\n",
      "*/\n",
      "\n",
      "\n",
      "CREATE TABLE employees (\n",
      "\tid TEXT NOT NULL, \n",
      "\tname TEXT, \n",
      "\tsurname TEXT, \n",
      "\tunit TEXT, \n",
      "\tCONSTRAINT employees_pkey PRIMARY KEY (id)\n",
      ")\n",
      "\n",
      "/*\n",
      "3 rows from employees table:\n",
      "id\tname\tsurname\tunit\n",
      "EMPLOYEE_1\tJane\tSmith\tHuman Resources\n",
      "EMPLOYEE_2\tDavid\tBrown\tEngineering\n",
      "EMPLOYEE_3\tOlivia\tDavis\tEngineering\n",
      "*/\n"
     ]
    }
   ],
   "source": [
    "#SQL\n",
    "from langchain.llms import OpenAI\n",
    "from langchain.utilities import SQLDatabase\n",
    "from langchain_experimental.sql import SQLDatabaseChain\n",
    "\n",
    "# Setup database\n",
    "database = \"corso-kg-postgres\"\n",
    "db = SQLDatabase.from_uri(\n",
    "    f\"postgresql+psycopg2://postgres:kgCefriel@corso-kg-postgres:5432/{database}\",\n",
    ")\n",
    "\n",
    "print(db.get_table_info())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "86fa5e2a-61fd-417f-b6fa-3c596664ecf7",
   "metadata": {},
   "outputs": [],
   "source": [
    "chain_sql = SQLDatabaseChain.from_llm(ChatOpenAI(temperature=0), db=db, verbose=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "22b34388-95b0-4edb-97bd-32c89cf9f3b4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new SQLDatabaseChain chain...\u001b[0m\n",
      "Retrieve the complete list of competences of Jane Brown?\n",
      "SQLQuery:\u001b[32;1m\u001b[1;3mSELECT c.competence\n",
      "FROM competences c\n",
      "JOIN assignment a ON c.id = a.competence_id\n",
      "JOIN employees e ON a.employee_id = e.id\n",
      "WHERE e.name = 'Jane' AND e.surname = 'Brown'\u001b[0m\n",
      "SQLResult: \u001b[33;1m\u001b[1;3m[('Protecting the environment',), ('Protecting health and well-being',), ('Protecting personal data and privacy',), ('Programming',), ('Managing data, information and digital content',), ('Copyright and licences',), ('Creatively using digital technologies',), ('Solving technical problems',), ('Interacting through digital technologies',), ('Netiquette',)]\u001b[0m\n",
      "Answer:\u001b[32;1m\u001b[1;3mProtecting the environment, Protecting health and well-being, Protecting personal data and privacy, Programming, Managing data, information and digital content, Copyright and licences, Creatively using digital technologies, Solving technical problems, Interacting through digital technologies, Netiquette\u001b[0m\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Protecting the environment, Protecting health and well-being, Protecting personal data and privacy, Programming, Managing data, information and digital content, Copyright and licences, Creatively using digital technologies, Solving technical problems, Interacting through digital technologies, Netiquette'"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sql.run(\"Retrieve the complete list of competences of Jane Brown\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "b39e43af-c98b-423c-9530-f3e72e57630a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new SQLDatabaseChain chain...\u001b[0m\n",
      "What are the competences of Jane Brown?\n",
      "SQLQuery:\u001b[32;1m\u001b[1;3mSELECT c.competence\n",
      "FROM employees e\n",
      "JOIN assignment a ON e.id = a.employee_id\n",
      "JOIN competences c ON a.competence_id = c.id\n",
      "WHERE e.name = 'Jane' AND e.surname = 'Brown'\n",
      "LIMIT 5;\u001b[0m\n",
      "SQLResult: \u001b[33;1m\u001b[1;3m[('Protecting the environment',), ('Protecting health and well-being',), ('Protecting personal data and privacy',), ('Programming',), ('Managing data, information and digital content',)]\u001b[0m\n",
      "Answer:\u001b[32;1m\u001b[1;3mThe competences of Jane Brown are:\n",
      "- Protecting the environment\n",
      "- Protecting health and well-being\n",
      "- Protecting personal data and privacy\n",
      "- Programming\n",
      "- Managing data, information and digital content\u001b[0m\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The competences of Jane Brown are:\\n- Protecting the environment\\n- Protecting health and well-being\\n- Protecting personal data and privacy\\n- Programming\\n- Managing data, information and digital content'"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sql.run(\"What are the competences of Jane Brown?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "f248d5e8-6ea6-4c11-b5fb-4010b90e1b5d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new SQLDatabaseChain chain...\u001b[0m\n",
      "Which are the employees with competences similar to the ones of Jane Brown?\n",
      "SQLQuery:\u001b[32;1m\u001b[1;3mSELECT e.name, e.surname\n",
      "FROM employees e\n",
      "JOIN assignment a ON e.id = a.employee_id\n",
      "JOIN competences c ON a.competence_id = c.id\n",
      "WHERE e.surname = 'Brown' AND e.name != 'Jane'\n",
      "LIMIT 5;\u001b[0m\n",
      "SQLResult: \u001b[33;1m\u001b[1;3m[('David', 'Brown'), ('David', 'Brown'), ('David', 'Brown'), ('David', 'Brown'), ('David', 'Brown')]\u001b[0m\n",
      "Answer:\u001b[32;1m\u001b[1;3mFinal answer: The employees with competences similar to the ones of Jane Brown are David Brown.\u001b[0m\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Final answer: The employees with competences similar to the ones of Jane Brown are David Brown.'"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sql.run(\"Which are the employees with competences similar to the ones of Jane Brown?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "449629bb-fc78-46b3-a965-11ac56d93b92",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new SQLDatabaseChain chain...\u001b[0m\n",
      "Identify the name and surname of the employee that has the higher number of competences in common with Jane Brown? Exclude Jane Smith from the results\n",
      "SQLQuery:\u001b[32;1m\u001b[1;3mSELECT e.name, e.surname\n",
      "FROM employees e\n",
      "JOIN assignment a ON e.id = a.employee_id\n",
      "JOIN competences c ON a.competence_id = c.id\n",
      "WHERE e.surname <> 'Smith' AND e.name <> 'Jane' AND e.surname = 'Brown'\n",
      "GROUP BY e.name, e.surname\n",
      "ORDER BY COUNT(DISTINCT a.competence_id) DESC\n",
      "LIMIT 1;\u001b[0m\n",
      "SQLResult: \u001b[33;1m\u001b[1;3m[('David', 'Brown')]\u001b[0m\n",
      "Answer:\u001b[32;1m\u001b[1;3mDavid Brown\u001b[0m\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'David Brown'"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sql.run(\"Identify the name and surname of the employee that has the higher number of competences in common with Jane Brown? Exclude Jane Smith from the results\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "49412dc6-4428-4ead-a83e-802855f6752b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# NEO4J\n",
    "from langchain.chat_models import ChatOpenAI\n",
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain.graphs import Neo4jGraph\n",
    "\n",
    "neo4j_graph = Neo4jGraph(\n",
    "    url=\"bolt://corso-kg-neo4j:7687\", username=\"neo4j\", password=\"kgCefriel\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "65c28a1a-d243-4c6e-9d6a-0b88a0c36a9a",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "        Node properties are the following:\n",
      "        [{'properties': [{'property': 'competence', 'type': 'STRING'}, {'property': 'dimension', 'type': 'STRING'}, {'property': 'description', 'type': 'STRING'}, {'property': 'competenceId', 'type': 'STRING'}], 'labels': 'Competence'}, {'properties': [{'property': 'surname', 'type': 'STRING'}, {'property': 'employeeId', 'type': 'STRING'}, {'property': 'name', 'type': 'STRING'}], 'labels': 'Employee'}, {'properties': [{'property': 'unitName', 'type': 'STRING'}], 'labels': 'Unit'}]\n",
      "        Relationship properties are the following:\n",
      "        [{'type': 'HAS_COMPETENCE', 'properties': [{'property': 'level', 'type': 'STRING'}]}]\n",
      "        The relationships are the following:\n",
      "        ['(:Employee)-[:INTERESTED_IN]->(:Competence)', '(:Employee)-[:IN_UNIT]->(:Unit)', '(:Employee)-[:HAS_COMPETENCE]->(:Competence)']\n",
      "        \n"
     ]
    }
   ],
   "source": [
    "#graph.refresh_schema()\n",
    "print(neo4j_graph.get_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "34505bba-6e8b-4bad-862c-96247f6e1369",
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_chain = GraphCypherQAChain.from_llm(\n",
    "    ChatOpenAI(temperature=0), graph=neo4j_graph, verbose=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "a1dcb1b8-b9bd-4b9a-999e-fc13e2bc5957",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (e:Employee {name: 'Jane', surname: 'Smith'})-[:HAS_COMPETENCE]->(c:Competence)\n",
      "RETURN c.competence\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'c.competence': 'Managing data, information and digital content'}, {'c.competence': 'Protecting health and well-being'}, {'c.competence': 'Protecting the environment'}, {'c.competence': 'Protecting personal data and privacy'}, {'c.competence': 'Solving technical problems'}, {'c.competence': 'Identifying digital competence gaps'}, {'c.competence': 'Protecting devices'}, {'c.competence': 'Creatively using digital technologies'}, {'c.competence': 'Copyright and licences'}, {'c.competence': 'Browsing, searching and filtering data, information and digital content'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"I'm sorry, but I don't have any information about Jane Smith's competences.\""
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_chain.run(\"What are the competences of Jane Smith?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "911e215a-28a8-4d69-9660-718b1ddec951",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (jane:Employee {name: 'Jane', surname: 'Smith'})-[:INTERESTED_IN]->(janeCompetence:Competence)\n",
      "WITH jane, janeCompetence\n",
      "MATCH (employee:Employee)-[:INTERESTED_IN]->(employeeCompetence:Competence)\n",
      "WHERE employee <> jane\n",
      "WITH jane, janeCompetence, employee, employeeCompetence\n",
      "MATCH (employee)-[:HAS_COMPETENCE]->(commonCompetence:Competence)\n",
      "WHERE commonCompetence.competenceId = janeCompetence.competenceId\n",
      "RETURN employee.name, employee.surname, COUNT(commonCompetence) AS numCommonCompetences\n",
      "ORDER BY numCommonCompetences DESC\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'employee.name': 'Michael', 'employee.surname': 'Smith', 'numCommonCompetences': 102}, {'employee.name': 'Michael', 'employee.surname': 'Taylor', 'numCommonCompetences': 79}, {'employee.name': 'John', 'employee.surname': 'Smith', 'numCommonCompetences': 74}, {'employee.name': 'David', 'employee.surname': 'Brown', 'numCommonCompetences': 72}, {'employee.name': 'David', 'employee.surname': 'Wilson', 'numCommonCompetences': 70}, {'employee.name': 'John', 'employee.surname': 'Johnson', 'numCommonCompetences': 55}, {'employee.name': 'Olivia', 'employee.surname': 'Miller', 'numCommonCompetences': 55}, {'employee.name': 'Michael', 'employee.surname': 'Johnson', 'numCommonCompetences': 55}, {'employee.name': 'Daniel', 'employee.surname': 'Davis', 'numCommonCompetences': 50}, {'employee.name': 'Olivia', 'employee.surname': 'Johnson', 'numCommonCompetences': 50}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The employees that have the highest number of competences in common with Jane Smith, excluding Jane Smith herself, are Michael Smith with 102 common competences, Michael Taylor with 79 common competences, John Smith with 74 common competences, David Brown with 72 common competences, and David Wilson with 70 common competences.'"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher_chain.run(\"Identify the employees that have the higher number of competences in common with Jane Smith? Exclude Jane Smith from the results\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "15965ce4-19d1-4233-baec-d49765143851",
   "metadata": {},
   "outputs": [],
   "source": [
    "# RDF\n",
    "rdf_file = join(folder, \"rdf/knowledge-graph.ttl\")\n",
    "rdf_graph = RdfGraph(\n",
    "    source_file=rdf_file,\n",
    "    standard=\"rdf\",\n",
    "    serialization= \"ttl\",\n",
    "    local_copy=rdf_file,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "700add07-d9f9-49f4-8dc5-810ca98c83bd",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "In the following, each IRI is followed by the local name and optionally its description in parentheses. \n",
      "The RDF graph supports the following node types:\n",
      "<http://www.cefriel.com/corso-kg/schema/Competence> (Competence, None), <http://www.cefriel.com/corso-kg/schema/EmployeeCompetence> (EmployeeCompetence, None), <http://www.cefriel.com/corso-kg/schema/Employee> (Employee, None), <http://xmlns.com/foaf/0.1/Person> (Person, None), <http://xmlns.com/foaf/0.1/Group> (Group, None)\n",
      "The RDF graph supports the following relationships:\n",
      "<http://www.cefriel.com/corso-kg/schema/employee> (employee, None), <http://xmlns.com/foaf/0.1/member> (member, None), <http://xmlns.com/foaf/0.1/name> (name, None), <http://www.cefriel.com/corso-kg/schema/competence> (competence, None), <http://www.cefriel.com/corso-kg/schema/level> (level, None), <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> (type, None), <http://xmlns.com/foaf/0.1/surname> (surname, None), <http://xmlns.com/foaf/0.1/title> (title, None)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# graph.load_schema()\n",
    "print(rdf_graph.get_schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "d9497f06-9e63-408b-8715-9e843ec4e8c9",
   "metadata": {},
   "outputs": [],
   "source": [
    "chain_sparql = GraphSparqlQAChain.from_llm(\n",
    "    ChatOpenAI(temperature=0), graph=rdf_graph, verbose=True\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "66f353d9-03d0-4280-a7a0-771f1fcdfec3",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "SELECT ?surname\n",
      "WHERE {\n",
      "    ?person foaf:name \"Jane\" .\n",
      "    ?person foaf:surname ?surname .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[(rdflib.term.Literal('Brown'),), (rdflib.term.Literal('Taylor'),), (rdflib.term.Literal('Brown'),), (rdflib.term.Literal('Smith'),), (rdflib.term.Literal('Miller'),)]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The surnames of the employees named Jane are Brown, Taylor, Brown, Smith, and Miller.'"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run(\"What are the surnames of the employees named Jane\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "e273efc4-67fa-4932-96ad-e9ab2a703af3",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX schema: <http://www.cefriel.com/corso-kg/schema/>\n",
      "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "\n",
      "SELECT ?competence\n",
      "WHERE {\n",
      "    ?employee foaf:name \"Jane Smith\" .\n",
      "    ?employee schema:employee ?employeeCompetence .\n",
      "    ?employeeCompetence schema:competence ?competence .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Jane Smith has the following competences: [competence 1], [competence 2], [competence 3], and so on.'"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run(\"List the competences of Jane Brown\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "2cae1cee-f8a3-412d-942c-a64235e0a094",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX cefriel: <http://www.cefriel.com/corso-kg/schema/>\n",
      "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "\n",
      "SELECT ?competence\n",
      "WHERE {\n",
      "    ?employee foaf:name \"Jane\" .\n",
      "    ?employee foaf:surname \"Smith\" .\n",
      "    ?employee cefriel:employeeCompetence ?employeeCompetence .\n",
      "    ?employeeCompetence cefriel:competence ?competence .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The employee competences of Jane Smith are not available in the provided information.'"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run(\"List the employee competences of the employee with name Jane and surname Smith\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "150030c0-fccd-4007-a633-d615d0958fc4",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphSparqlQAChain chain...\u001b[0m\n",
      "Identified intent:\n",
      "\u001b[32;1m\u001b[1;3mSELECT\u001b[0m\n",
      "Generated SPARQL:\n",
      "\u001b[32;1m\u001b[1;3mPREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
      "PREFIX schema: <http://www.cefriel.com/corso-kg/schema/>\n",
      "\n",
      "SELECT ?competence\n",
      "WHERE {\n",
      "    ?employee foaf:name \"Jane\" .\n",
      "    ?employee foaf:surname \"Smith\" .\n",
      "    ?employeeCompetence schema:employee ?employee .\n",
      "    ?employeeCompetence schema:competence ?competence .\n",
      "}\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[(rdflib.term.URIRef('http://data.europa.eu/snb/dcf/9i6ta81748'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/3h9eab1489'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/4s23kdq383'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/9a5d39t62b'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/1dz4n8r554'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/7d4t7002v7'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/u69o196gu6'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/sq0c9q6116'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/2mi55kl065'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/0690r7o8r2'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/aa985fr035'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/1b043jw49b'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/mg54my1580'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/13z458t54u'),), (rdflib.term.URIRef('http://data.europa.eu/snb/dcf/860966ekgo'),)]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The competences related to the employee with the name Jane and surname Smith through the EmployeeCompetence are as follows: \\n\\n- http://data.europa.eu/snb/dcf/9i6ta81748\\n- http://data.europa.eu/snb/dcf/3h9eab1489\\n- http://data.europa.eu/snb/dcf/4s23kdq383\\n- http://data.europa.eu/snb/dcf/9a5d39t62b\\n- http://data.europa.eu/snb/dcf/1dz4n8r554\\n- http://data.europa.eu/snb/dcf/7d4t7002v7\\n- http://data.europa.eu/snb/dcf/u69o196gu6\\n- http://data.europa.eu/snb/dcf/sq0c9q6116\\n- http://data.europa.eu/snb/dcf/2mi55kl065\\n- http://data.europa.eu/snb/dcf/0690r7o8r2\\n- http://data.europa.eu/snb/dcf/aa985fr035\\n- http://data.europa.eu/snb/dcf/1b043jw49b\\n- http://data.europa.eu/snb/dcf/mg54my1580\\n- http://data.europa.eu/snb/dcf/13z458t54u\\n- http://data.europa.eu/snb/dcf/860966ekgo'"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_sparql.run(\"List the competences related to employee with name Jane and surname Smith through EmployeeCompetence\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b54b5bd3-2868-4ff2-91e0-0e9a25ab0b80",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
