{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 80,
   "id": "04ce129b-0e6b-4e5a-b2f2-e61263c80736",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: rdflib in /opt/conda/lib/python3.11/site-packages (6.3.2)\n",
      "Requirement already satisfied: yatter in /opt/conda/lib/python3.11/site-packages (1.1.0)\n",
      "Requirement already satisfied: morph-kgc in /opt/conda/lib/python3.11/site-packages (2.6.2)\n",
      "Requirement already satisfied: isodate<0.7.0,>=0.6.0 in /opt/conda/lib/python3.11/site-packages (from rdflib) (0.6.1)\n",
      "Requirement already satisfied: pyparsing<4,>=2.1.0 in /opt/conda/lib/python3.11/site-packages (from rdflib) (3.0.9)\n",
      "Requirement already satisfied: ruamel.yaml>=0.17.21 in /opt/conda/lib/python3.11/site-packages (from yatter) (0.17.32)\n",
      "Requirement already satisfied: coloredlogs>=15.0.1 in /opt/conda/lib/python3.11/site-packages (from yatter) (15.0.1)\n",
      "Requirement already satisfied: duckdb<2.0.0,>=0.7.0 in /opt/conda/lib/python3.11/site-packages (from morph-kgc) (0.8.1)\n",
      "Requirement already satisfied: elementpath<5.0.0,>=4.0.1 in /opt/conda/lib/python3.11/site-packages (from morph-kgc) (4.1.4)\n",
      "Requirement already satisfied: falcon<4.0.0,>=3.0.0 in /opt/conda/lib/python3.11/site-packages (from morph-kgc) (3.1.1)\n",
      "Requirement already satisfied: jsonpath-python<2.0.0,>=1.0.6 in /opt/conda/lib/python3.11/site-packages (from morph-kgc) (1.0.6)\n",
      "Requirement already satisfied: pandas<2.0.0,>=1.4.0 in /opt/conda/lib/python3.11/site-packages (from morph-kgc) (1.5.3)\n",
      "Requirement already satisfied: pyoxigraph<1.0.0,>=0.3.10 in /opt/conda/lib/python3.11/site-packages (from morph-kgc) (0.3.18)\n",
      "Requirement already satisfied: sql-metadata<3.0.0,>=2.6.0 in /opt/conda/lib/python3.11/site-packages (from morph-kgc) (2.8.0)\n",
      "Requirement already satisfied: sqlalchemy<2.0.0,>=1.4.0 in /opt/conda/lib/python3.11/site-packages (from morph-kgc) (1.4.49)\n",
      "Requirement already satisfied: humanfriendly>=9.1 in /opt/conda/lib/python3.11/site-packages (from coloredlogs>=15.0.1->yatter) (10.0)\n",
      "Requirement already satisfied: six in /opt/conda/lib/python3.11/site-packages (from isodate<0.7.0,>=0.6.0->rdflib) (1.16.0)\n",
      "Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.11/site-packages (from pandas<2.0.0,>=1.4.0->morph-kgc) (2.8.2)\n",
      "Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.11/site-packages (from pandas<2.0.0,>=1.4.0->morph-kgc) (2023.3)\n",
      "Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.11/site-packages (from pandas<2.0.0,>=1.4.0->morph-kgc) (1.24.4)\n",
      "Requirement already satisfied: ruamel.yaml.clib>=0.2.7 in /opt/conda/lib/python3.11/site-packages (from ruamel.yaml>=0.17.21->yatter) (0.2.7)\n",
      "Requirement already satisfied: sqlparse<0.5.0,>=0.4.1 in /opt/conda/lib/python3.11/site-packages (from sql-metadata<3.0.0,>=2.6.0->morph-kgc) (0.4.4)\n",
      "Requirement already satisfied: greenlet!=0.4.17 in /opt/conda/lib/python3.11/site-packages (from sqlalchemy<2.0.0,>=1.4.0->morph-kgc) (2.0.2)\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "!{sys.executable} -m pip install rdflib yatter morph-kgc"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "567abcbb-890e-48a9-8180-c1424336e2e4",
   "metadata": {},
   "outputs": [],
   "source": [
    "from os import getcwd\n",
    "from os.path import join, dirname\n",
    "folder = dirname(getcwd())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "3fe54e50-8e9b-410e-82c5-3b837f2f29bf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1,8b23nt41l4\n",
      "1.1,9i6ta81748\n",
      "1.2,3h9eab1489\n",
      "1.3,4s23kdq383\n",
      "2,2k3209g1wc\n",
      "2.1,8ys96p08p4\n",
      "2.2,9a5d39t62b\n",
      "2.3,1dz4n8r554\n",
      "2.4,y2s2861s9p\n",
      "2.5,99vvo91542\n",
      "2.6,7d4t7002v7\n",
      "3,4b465z8p2e\n",
      "3.1,u69o196gu6\n",
      "3.2,sq0c9q6116\n",
      "3.3,2mi55kl065\n",
      "3.4,0690r7o8r2\n",
      "4,1fz48677f4\n",
      "4.1,aa985fr035\n",
      "4.2,1b043jw49b\n",
      "4.3,mg54my1580\n",
      "4.4,o9e8s72z21\n",
      "5,86xdxt8620\n",
      "5.1,13z458t54u\n",
      "5.2,00b51s9rc5\n",
      "5.3,3bgx2a6278\n",
      "5.4,860966ekgo\n"
     ]
    }
   ],
   "source": [
    "from rdflib import Graph\n",
    "# Load RDF data from file\n",
    "g = Graph()\n",
    "rdf_file = join(folder, \"rdf/digital-competence-framework-skos-ap-eu.rdf\")  # Replace with the actual path to your RDF file\n",
    "g.parse(rdf_file, format=\"xml\")     # Specify the appropriate format if not XML\n",
    "\n",
    "# SPARQL query\n",
    "sparql_query = \"\"\"\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    \n",
    "    SELECT DISTINCT ?label ?id\n",
    "    WHERE {\n",
    "      ?s skos:prefLabel ?label ;\n",
    "          dc:identifier ?id .\n",
    "      FILTER (!CONTAINS(?label, 'Level'))\n",
    "    }\n",
    "    ORDER BY ?label\n",
    "\"\"\"\n",
    "\n",
    "# Execute the SPARQL query\n",
    "results = g.query(sparql_query)\n",
    "\n",
    "# Print the query results\n",
    "for row in results:\n",
    "    label = str(row.label)[:3].strip()\n",
    "    if len(label) == 2:\n",
    "        label = label[:1]\n",
    "    print(f\"{label},{row.id}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "10ac0463-0a60-4a22-97e2-758834e9f69f",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2023-07-19 08:05:42,734 | INFO: Translating YARRRML mapping to [R2]RML\n",
      "2023-07-19 08:05:42,736 | INFO: RML content is created!\n",
      "2023-07-19 08:05:42,748 | INFO: Mapping has been syntactically validated.\n",
      "2023-07-19 08:05:42,749 | INFO: Translation has finished successfully.\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "@prefix kg: <http://www.cefriel.com/corso-kg/data/>.\n",
      "@prefix ex: <http://www.cefriel.com/corso-kg/schema/>.\n",
      "@prefix skos: <http://www.w3.org/2004/02/skos/core#>.\n",
      "@prefix rr: <http://www.w3.org/ns/r2rml#>.\n",
      "@prefix rml: <http://semweb.mmlab.be/ns/rml#>.\n",
      "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>.\n",
      "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#>.\n",
      "@prefix xsd: <http://www.w3.org/2001/XMLSchema#>.\n",
      "@prefix ql: <http://semweb.mmlab.be/ns/ql#>.\n",
      "@prefix d2rq: <http://www.wiwiss.fu-berlin.de/suhl/bizer/D2RQ/0.1#>.\n",
      "@prefix foaf: <http://xmlns.com/foaf/0.1/>.\n",
      "@prefix schema: <http://schema.org/>.\n",
      "@prefix formats: <http://www.w3.org/ns/formats/>.\n",
      "@prefix comp: <http://semweb.mmlab.be/ns/rml-compression#>.\n",
      "@prefix void: <http://rdfs.org/ns/void#>.\n",
      "@prefix fnml: <http://semweb.mmlab.be/ns/fnml#>.\n",
      "@prefix grel: <http://users.ugent.be/~bjdmeest/function/grel.ttl#>.\n",
      "@base <http://example.com/ns#>.\n",
      "\n",
      "\n",
      "<unit_0> a rr:TriplesMap;\n",
      "\n",
      "\trml:logicalSource [\n",
      "\t\ta rml:LogicalSource;\n",
      "\t\trml:source \"./../data/employees.csv\";\n",
      "\t\trml:referenceFormulation ql:CSV\n",
      "\t];\n",
      "\trr:subjectMap [\n",
      "\t\ta rr:SubjectMap;\n",
      "\t\trr:template \"http://www.cefriel.com/corso-kg/data/unit/{unit}\";\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant rdf:type;\n",
      "\t\t];\n",
      "\t\trr:objectMap [\n",
      "\t\t\ta rr:ObjectMap;\n",
      "\t\t\trr:constant foaf:Group;\n",
      "\t\t];\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant foaf:title;\n",
      "\t\t];\n",
      "\t\trr:objectMap [\n",
      "\t\t\ta rr:ObjectMap;\n",
      "\t\t\trml:reference \"unit\";\n",
      "\t\t];\n",
      "\t].\n",
      "\n",
      "\n",
      "<employee_0> a rr:TriplesMap;\n",
      "\n",
      "\trml:logicalSource [\n",
      "\t\ta rml:LogicalSource;\n",
      "\t\trml:source \"./../data/employees.csv\";\n",
      "\t\trml:referenceFormulation ql:CSV\n",
      "\t];\n",
      "\trr:subjectMap [\n",
      "\t\ta rr:SubjectMap;\n",
      "\t\trr:template \"http://www.cefriel.com/corso-kg/data/employee/{id}\";\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant rdf:type;\n",
      "\t\t];\n",
      "\t\trr:objectMap [\n",
      "\t\t\ta rr:ObjectMap;\n",
      "\t\t\trr:constant foaf:Person;\n",
      "\t\t];\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant rdf:type;\n",
      "\t\t];\n",
      "\t\trr:objectMap [\n",
      "\t\t\ta rr:ObjectMap;\n",
      "\t\t\trr:constant ex:Employee;\n",
      "\t\t];\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant foaf:name;\n",
      "\t\t];\n",
      "\t\trr:objectMap [\n",
      "\t\t\ta rr:ObjectMap;\n",
      "\t\t\trml:reference \"name\";\n",
      "\t\t];\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant foaf:surname;\n",
      "\t\t];\n",
      "\t\trr:objectMap [\n",
      "\t\t\ta rr:ObjectMap;\n",
      "\t\t\trml:reference \"surname\";\n",
      "\t\t];\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant foaf:member;\n",
      "\t\t];\n",
      "\t\trr:objectMap [ \n",
      "\t\t\ta rr:RefObjectMap;\n",
      "\t\t\trr:parentTriplesMap <unit_0>;\n",
      "\t\t\trr:joinCondition [\n",
      "\t\t\t\trr:child \"unit\";\n",
      "\t\t\t\trr:parent \"unit\";\n",
      "\t\t\t]; \n",
      "\t\t];\n",
      "\t].\n",
      "\n",
      "\n",
      "<competences_0> a rr:TriplesMap;\n",
      "\n",
      "\trml:logicalSource [\n",
      "\t\ta rml:LogicalSource;\n",
      "\t\trml:source \"./../data/competences-iri.csv\";\n",
      "\t\trml:referenceFormulation ql:CSV\n",
      "\t];\n",
      "\trr:subjectMap [\n",
      "\t\ta rr:SubjectMap;\n",
      "\t\trr:template \"http://data.europa.eu/snb/dcf/{iri}\";\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant rdf:type;\n",
      "\t\t];\n",
      "\t\trr:objectMap [\n",
      "\t\t\ta rr:ObjectMap;\n",
      "\t\t\trr:constant ex:Competence;\n",
      "\t\t];\n",
      "\t].\n",
      "\n",
      "\n",
      "<assignment_0> a rr:TriplesMap;\n",
      "\n",
      "\trml:logicalSource [\n",
      "\t\ta rml:LogicalSource;\n",
      "\t\trml:source \"./../data/assignment.csv\";\n",
      "\t\trml:referenceFormulation ql:CSV\n",
      "\t];\n",
      "\trr:subjectMap [\n",
      "\t\ta rr:SubjectMap;\n",
      "\t\trr:template \"http://www.cefriel.com/corso-kg/data/assignment/{employee_id}-{competence_id}\";\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant rdf:type;\n",
      "\t\t];\n",
      "\t\trr:objectMap [\n",
      "\t\t\ta rr:ObjectMap;\n",
      "\t\t\trr:constant ex:EmployeeCompetence;\n",
      "\t\t];\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant ex:level;\n",
      "\t\t];\n",
      "\t\trr:objectMap [\n",
      "\t\t\ta rr:ObjectMap;\n",
      "\t\t\trml:reference \"level\";\n",
      "\t\t\trr:datatype xsd:int\n",
      "\t\t];\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant ex:employee;\n",
      "\t\t];\n",
      "\t\trr:objectMap [ \n",
      "\t\t\ta rr:RefObjectMap;\n",
      "\t\t\trr:parentTriplesMap <employee_0>;\n",
      "\t\t\trr:joinCondition [\n",
      "\t\t\t\trr:child \"employee_id\";\n",
      "\t\t\t\trr:parent \"id\";\n",
      "\t\t\t]; \n",
      "\t\t];\n",
      "\t];\n",
      "\trr:predicateObjectMap [\n",
      "\t\trr:predicateMap [\n",
      "\t\t\ta rr:PredicateMap;\n",
      "\t\t\trr:constant ex:competence;\n",
      "\t\t];\n",
      "\t\trr:objectMap [ \n",
      "\t\t\ta rr:RefObjectMap;\n",
      "\t\t\trr:parentTriplesMap <competences_0>;\n",
      "\t\t\trr:joinCondition [\n",
      "\t\t\t\trr:child \"competence_id\";\n",
      "\t\t\t\trr:parent \"id\";\n",
      "\t\t\t]; \n",
      "\t\t];\n",
      "\t].\n",
      "\n",
      "\n",
      "\n"
     ]
    }
   ],
   "source": [
    "import yatter\n",
    "from ruamel.yaml import YAML\n",
    "\n",
    "# YARRRML to RML\n",
    "yaml = YAML(typ='safe', pure=True)\n",
    "mappings_file = join(folder, \"mappings/corso-kg-yarrrml.yml\")\n",
    "rml_content = yatter.translate(yaml.load(open(mappings_file)))\n",
    "\n",
    "# Print generated RML triples\n",
    "print(rml_content)\n",
    "\n",
    "# Save RML to file\n",
    "rml_file = join(folder, \"mappings/corso-kg-rml.ttl\")\n",
    "with open(rml_file, \"w\") as rml_output:\n",
    "    rml_output.write(rml_content)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "id": "797e9175-8961-4096-aa53-ce4f309d2762",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "2023-07-19 09:49:29,216 | DEBUG: CONFIGURATION: {'output_file': 'knowledge-graph', 'na_values': ',nan', 'safe_percent_encoding': '', 'read_parsed_mappings_path': '', 'write_parsed_mappings_path': '', 'mapping_partitioning': 'PARTIAL-AGGREGATIONS', 'logging_file': '', 'oracle_client_lib_dir': '', 'oracle_client_config_dir': '', 'udfs': '', 'output_dir': '', 'output_format': 'N-TRIPLES', 'only_printable_chars': 'no', 'infer_sql_datatypes': 'no', 'logging_level': 'INFO', 'number_of_processes': '16'}\n",
      "2023-07-19 09:49:29,217 | DEBUG: DATA SOURCE `Competences`: {'mappings': './../mappings/corso-kg-rml.ttl'}\n",
      "2023-07-19 09:49:30,115 | DEBUG: Removed self-join from mapping rule `#TM6`.\n",
      "2023-07-19 09:49:30,120 | INFO: 12 mapping rules retrieved.\n",
      "2023-07-19 09:49:30,136 | INFO: Mapping partition with 1 groups generated.\n",
      "2023-07-19 09:49:30,138 | INFO: Maximum number of rules within mapping group: 12.\n",
      "2023-07-19 09:49:30,139 | INFO: Mappings processed in 0.915 seconds.\n",
      "2023-07-19 09:49:30,142 | DEBUG: Parallelizing with 16 cores.\n",
      "2023-07-19 09:49:30,572 | INFO: Number of triples generated in total: 1240.\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Ne9b8c62afc9c4d1cb9faf1570274906e (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 111,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import morph_kgc\n",
    "\n",
    "config = \"\"\"      \n",
    "            [Competences]\n",
    "            mappings: ./../mappings/corso-kg-rml.ttl\n",
    "         \"\"\"\n",
    "# Generate the triples and load them to an RDFLib graph\n",
    "g_rdflib = morph_kgc.materialize(config)\n",
    "\n",
    "mapping_file = join(folder, \"mappings/corso-kg-rml.ttl\")\n",
    "g_mappings = Graph()\n",
    "g_mappings.parse(mapping_file, format='ttl')\n",
    "\n",
    "for ns_prefix, namespace in g_mappings.namespaces():\n",
    "    g_rdflib.bind(ns_prefix, namespace)\n",
    "\n",
    "# Save to file\n",
    "output_file = join(folder, \"rdf/knowledge-graph.ttl\")\n",
    "g_rdflib.serialize(destination=output_file, format='ttl', encoding=\"utf-8\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "49771016-c967-41d7-b4e4-9950c412631d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of triples generated: 1240\n"
     ]
    }
   ],
   "source": [
    "q_res = g_rdflib.query('SELECT (COUNT(*) AS ?num_triples) WHERE { ?s ?p ?o }')\n",
    "\n",
    "# Print the query results\n",
    "for row in q_res:\n",
    "    print(f\"Number of triples generated: {row.num_triples}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "4b93107a-51ee-4b35-89a6-3f587389f45a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N8ab7f8d6b0d94d3497469ff52093288e (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 100,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ontology_file = join(folder, \"rdf/digital-competence-framework-skos-ap-eu.rdf\")\n",
    "g_rdflib.parse(ontology_file, format='xml')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "7156958c-1e97-4723-b165-86d12af05fe1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of triples generated: 9224\n"
     ]
    }
   ],
   "source": [
    "q_res = g_rdflib.query('SELECT (COUNT(*) AS ?num_triples) WHERE { ?s ?p ?o }')\n",
    "\n",
    "# Print the query results\n",
    "for row in q_res:\n",
    "    print(f\"Number of triples generated: {row.num_triples}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "id": "806991f4-3d37-4f7e-8ff6-b9c07b114bac",
   "metadata": {},
   "outputs": [],
   "source": [
    "sparql_query = \"\"\"\n",
    "    PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "    PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "    PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "    PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "    PREFIX kg: <http://www.cefriel.com/corso-kg/data/>\n",
    "    PREFIX ex: <http://www.cefriel.com/corso-kg/schema/>\n",
    "    PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "    \n",
    "    SELECT ?s\n",
    "    WHERE {\n",
    "      ?s a ex:Employee .\n",
    "      }\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "f3d43844-7808-4799-a37e-b03b8b16100a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_12\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_1\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_11\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_27\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_8\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_20\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_28\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_7\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_15\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_19\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_4\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_21\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_30\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_14\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_16\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_5\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_9\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_17\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_3\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_29\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_2\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_23\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_18\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_22\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_24\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_13\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_26\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_25\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_10\n",
      "http://www.cefriel.com/corso-kg/data/employee/EMPLOYEE_6\n"
     ]
    }
   ],
   "source": [
    "results = g_rdflib.query(sparql_query)\n",
    "# Print the query results\n",
    "for row in results:\n",
    "    print(row.s)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "249b5197-61d2-4f5d-98f7-ad37f6078a09",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
